stm32duino/Arduino_Core_STM32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Nucleo 144 boards

Nucleo_144.name=Nucleo-144
Nucleo_144.build.core=arduino
Nucleo_144.build.board=Nucleo_144
Nucleo_144.build.variant_h=variant_{build.board}.h
Nucleo_144.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_144.build.flash_offset=0x0
Nucleo_144.upload.maximum_size=0
Nucleo_144.upload.maximum_data_size=0
Nucleo_144.vid.0=0x0483
Nucleo_144.pid.0=0x5740
# STlink V1/V2.1/V3
Nucleo_144.vid.1=0x0483
Nucleo_144.pid.1=0x3744
Nucleo_144.vid.2=0x0483
Nucleo_144.pid.2=0x3748
Nucleo_144.vid.3=0x0483
Nucleo_144.pid.3=0x374b
Nucleo_144.vid.4=0x0483
Nucleo_144.pid.4=0x374e
Nucleo_144.vid.5=0x0483
Nucleo_144.pid.5=0x374f
Nucleo_144.vid.6=0x0483
Nucleo_144.pid.6=0x3752
Nucleo_144.vid.7=0x0483
Nucleo_144.pid.7=0x3753

# NUCLEO_F207ZG board
Nucleo_144.menu.pnum.NUCLEO_F207ZG=Nucleo F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.node=NODE_F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_data_size=131072
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.mcu=cortex-m3
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.board=NUCLEO_F207ZG
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.series=STM32F2xx
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.product_line=STM32F207xx
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Nucleo_144.menu.pnum.NUCLEO_F207ZG.openocd.target=stm32f2x
Nucleo_144.menu.pnum.NUCLEO_F207ZG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# NUCLEO_F412ZG board
Nucleo_144.menu.pnum.NUCLEO_F412ZG=Nucleo F412ZG
Nucleo_144.menu.pnum.NUCLEO_F412ZG.node=NODE_F412ZG
Nucleo_144.menu.pnum.NUCLEO_F412ZG.upload.maximum_size=1048576
Nucleo_144.menu.pnum.NUCLEO_F412ZG.upload.maximum_data_size=262144
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.board=NUCLEO_F412ZG
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.product_line=STM32F412Zx
Nucleo_144.menu.pnum.NUCLEO_F412ZG.build.variant=STM32F4xx/F412Z(E-G)(J-T)
Nucleo_144.menu.pnum.NUCLEO_F412ZG.openocd.target=stm32f4x
Nucleo_144.menu.pnum.NUCLEO_F412ZG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

# NUCLEO_F413ZH board
Nucleo_144.menu.pnum.NUCLEO_F413ZH=Nucleo F413ZH
Nucleo_144.menu.pnum.NUCLEO_F413ZH.node=NODE_F413ZH
Nucleo_144.menu.pnum.NUCLEO_F413ZH.upload.maximum_size=1572864
Nucleo_144.menu.pnum.NUCLEO_F413ZH.upload.maximum_data_size=327680
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.board=NUCLEO_F413ZH
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.product_line=STM32F413xx
Nucleo_144.menu.pnum.NUCLEO_F413ZH.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)
Nucleo_144.menu.pnum.NUCLEO_F413ZH.openocd.target=stm32f4x
Nucleo_144.menu.pnum.NUCLEO_F413ZH.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F413.svd

# NUCLEO_F429ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
Nucleo_144.menu.pnum.NUCLEO_F429ZI=Nucleo F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.node=NODE_F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_data_size=196608
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.board=NUCLEO_F429ZI
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.product_line=STM32F429xx
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.variant_h=variant_NUCLEO_F4x9ZI.h
Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Nucleo_144.menu.pnum.NUCLEO_F429ZI.openocd.target=stm32f4x
Nucleo_144.menu.pnum.NUCLEO_F429ZI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F429.svd

# NUCLEO_F439ZI board
Nucleo_144.menu.pnum.NUCLEO_F439ZI=Nucleo F439ZI
Nucleo_144.menu.pnum.NUCLEO_F439ZI.node=NODE_F439ZI
Nucleo_144.menu.pnum.NUCLEO_F439ZI.upload.maximum_size=2097152
Nucleo_144.menu.pnum.NUCLEO_F439ZI.upload.maximum_data_size=196608
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.mcu=cortex-m4
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.float-abi=-mfloat-abi=hard
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.board=NUCLEO_F439ZI
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.series=STM32F4xx
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.product_line=STM32F439xx
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.variant_h=variant_NUCLEO_F4x9ZI.h
Nucleo_144.menu.pnum.NUCLEO_F439ZI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Nucleo_144.menu.pnum.NUCLEO_F439ZI.openocd.target=stm32f4x
Nucleo_144.menu.pnum.NUCLEO_F439ZI.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F439.svd

