stm32duino/Arduino_Core_STM32/boards.txt
# P_NUCLEO_WB55 USB Dongle
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE=P-Nucleo WB55 USB Dongle
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.upload.maximum_size=524288
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.upload.maximum_data_size=196608
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.mcu=cortex-m4
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.board=P_NUCLEO_WB55_USB_DONGLE
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.series=STM32WBxx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.product_line=STM32WB55xx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.openocd.target=stm32wbx
Nucleo_64.menu.pnum.P_NUCLEO_WB55_USB_DONGLE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# NUCLEO WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG=Nucleo WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.node="NOD_WBA52CG,NOD_WBA55CG"
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.mcu=cortex-m33
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.fpu=-mfpu=fpv4-sp-d16
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.float-abi=-mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.board=NUCLEO_WBA55CG
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.series=STM32WBAxx
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.product_line=STM32WBA55xx
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.build.variant=STM32WBAxx/WBA55C(E-G)U
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.openocd.target=stm32wbax
Nucleo_64.menu.pnum.NUCLEO_WBA55CG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# NUCLEO_WL55JC1 board
Nucleo_64.menu.pnum.NUCLEO_WL55JC1=Nucleo WL55JC1
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.node="NOD_WL55JC"
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.upload.maximum_size=262144
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.mcu=cortex-m4
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.board=NUCLEO_WL55JC1
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.series=STM32WLxx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.product_line=STM32WLE5xx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.openocd.target=stm32wlx
Nucleo_64.menu.pnum.NUCLEO_WL55JC1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Upload menu
Nucleo_64.menu.upload_method.MassStorage=Mass Storage
Nucleo_64.menu.upload_method.MassStorage.upload.protocol=
Nucleo_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_64.menu.upload_method.swdMethod.upload.protocol=swd
Nucleo_64.menu.upload_method.swdMethod.upload.options=
Nucleo_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Nucleo_64.menu.upload_method.jlinkMethod.upload.protocol=jlink
Nucleo_64.menu.upload_method.jlinkMethod.upload.options=
Nucleo_64.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_64.menu.upload_method.serialMethod.upload.protocol=serial
Nucleo_64.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Nucleo_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_64.menu.upload_method.dfuMethod.upload.protocol=dfu
Nucleo_64.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Nucleo_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Nucleo_64.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Nucleo_64.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Nucleo_64.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Nucleo_64.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Nucleo_64.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Nucleo 32 boards

Nucleo_32.name=Nucleo-32

Nucleo_32.build.core=arduino
Nucleo_32.build.board=Nucleo_32
Nucleo_32.build.variant_h=variant_{build.board}.h
Nucleo_32.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_32.build.flash_offset=0x0
Nucleo_32.upload.maximum_size=0
Nucleo_32.upload.maximum_data_size=0
Nucleo_32.vid.0=0x0483
Nucleo_32.pid.0=0x5740
# STlink V1/V2.1/V3
Nucleo_32.vid.1=0x0483
Nucleo_32.pid.1=0x3744
Nucleo_32.vid.2=0x0483
Nucleo_32.pid.2=0x3748
Nucleo_32.vid.3=0x0483
Nucleo_32.pid.3=0x374b
Nucleo_32.vid.4=0x0483
Nucleo_32.pid.4=0x374e
Nucleo_32.vid.5=0x0483
Nucleo_32.pid.5=0x374f
Nucleo_32.vid.6=0x0483
Nucleo_32.pid.6=0x3752
Nucleo_32.vid.7=0x0483
Nucleo_32.pid.7=0x3753

# NUCLEO_F031K6 board
Nucleo_32.menu.pnum.NUCLEO_F031K6=Nucleo F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.node=NODE_F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_size=32768
Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_data_size=4096
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.mcu=cortex-m0
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.board=NUCLEO_F031K6
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.series=STM32F0xx
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.product_line=STM32F031x6
Nucleo_32.menu.pnum.NUCLEO_F031K6.build.variant=STM32F0xx/F031K6T
Nucleo_32.menu.pnum.NUCLEO_F031K6.openocd.target=stm32f0x
Nucleo_32.menu.pnum.NUCLEO_F031K6.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

