stm32duino/Arduino_Core_STM32/boards.txt
# Generic C011F4Ux
GenC0.menu.pnum.GENERIC_C011F4UX=Generic C011F4Ux
GenC0.menu.pnum.GENERIC_C011F4UX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C011F4UX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F4UX.build.board=GENERIC_C011F4UX
GenC0.menu.pnum.GENERIC_C011F4UX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F4UX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P
GenC0.menu.pnum.GENERIC_C011F4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C011F6Ux
GenC0.menu.pnum.GENERIC_C011F6UX=Generic C011F6Ux
GenC0.menu.pnum.GENERIC_C011F6UX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011F6UX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011F6UX.build.board=GENERIC_C011F6UX
GenC0.menu.pnum.GENERIC_C011F6UX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011F6UX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P
GenC0.menu.pnum.GENERIC_C011F6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C011J4Mx
GenC0.menu.pnum.GENERIC_C011J4MX=Generic C011J4Mx
GenC0.menu.pnum.GENERIC_C011J4MX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C011J4MX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011J4MX.build.board=GENERIC_C011J4MX
GenC0.menu.pnum.GENERIC_C011J4MX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011J4MX.build.variant=STM32C0xx/C011J(4-6)M
GenC0.menu.pnum.GENERIC_C011J4MX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C011J6Mx
GenC0.menu.pnum.GENERIC_C011J6MX=Generic C011J6Mx
GenC0.menu.pnum.GENERIC_C011J6MX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C011J6MX.upload.maximum_data_size=6144
GenC0.menu.pnum.GENERIC_C011J6MX.build.board=GENERIC_C011J6MX
GenC0.menu.pnum.GENERIC_C011J6MX.build.product_line=STM32C011xx
GenC0.menu.pnum.GENERIC_C011J6MX.build.variant=STM32C0xx/C011J(4-6)M
GenC0.menu.pnum.GENERIC_C011J6MX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C011.svd

# Generic C031C4Tx
GenC0.menu.pnum.GENERIC_C031C4TX=Generic C031C4Tx
GenC0.menu.pnum.GENERIC_C031C4TX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031C4TX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C4TX.build.board=GENERIC_C031C4TX
GenC0.menu.pnum.GENERIC_C031C4TX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C4TX.build.variant=STM32C0xx/C031C(4-6)(T-U)
GenC0.menu.pnum.GENERIC_C031C4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C031C6Tx
GenC0.menu.pnum.GENERIC_C031C6TX=Generic C031C6Tx
GenC0.menu.pnum.GENERIC_C031C6TX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C031C6TX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C6TX.build.board=GENERIC_C031C6TX
GenC0.menu.pnum.GENERIC_C031C6TX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C6TX.build.variant=STM32C0xx/C031C(4-6)(T-U)
GenC0.menu.pnum.GENERIC_C031C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C031C4Ux
GenC0.menu.pnum.GENERIC_C031C4UX=Generic C031C4Ux
GenC0.menu.pnum.GENERIC_C031C4UX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031C4UX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C4UX.build.board=GENERIC_C031C4UX
GenC0.menu.pnum.GENERIC_C031C4UX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C4UX.build.variant=STM32C0xx/C031C(4-6)(T-U)
GenC0.menu.pnum.GENERIC_C031C4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C031C6Ux
GenC0.menu.pnum.GENERIC_C031C6UX=Generic C031C6Ux
GenC0.menu.pnum.GENERIC_C031C6UX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C031C6UX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031C6UX.build.board=GENERIC_C031C6UX
GenC0.menu.pnum.GENERIC_C031C6UX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031C6UX.build.variant=STM32C0xx/C031C(4-6)(T-U)
GenC0.menu.pnum.GENERIC_C031C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C031F4Px
GenC0.menu.pnum.GENERIC_C031F4PX=Generic C031F4Px
GenC0.menu.pnum.GENERIC_C031F4PX.upload.maximum_size=16384
GenC0.menu.pnum.GENERIC_C031F4PX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031F4PX.build.board=GENERIC_C031F4PX
GenC0.menu.pnum.GENERIC_C031F4PX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031F4PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P
GenC0.menu.pnum.GENERIC_C031F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C031F6Px
GenC0.menu.pnum.GENERIC_C031F6PX=Generic C031F6Px
GenC0.menu.pnum.GENERIC_C031F6PX.upload.maximum_size=32768
GenC0.menu.pnum.GENERIC_C031F6PX.upload.maximum_data_size=12288
GenC0.menu.pnum.GENERIC_C031F6PX.build.board=GENERIC_C031F6PX
GenC0.menu.pnum.GENERIC_C031F6PX.build.product_line=STM32C031xx
GenC0.menu.pnum.GENERIC_C031F6PX.build.variant=STM32C0xx/C011D6Y_C011F(4-6)(P-U)_C031F(4-6)P
GenC0.menu.pnum.GENERIC_C031F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C031.svd

# Generic C071R8Tx
GenC0.menu.pnum.GENERIC_C071R8TX=Generic C071R8Tx
GenC0.menu.pnum.GENERIC_C071R8TX.upload.maximum_size=65536
GenC0.menu.pnum.GENERIC_C071R8TX.upload.maximum_data_size=24576
GenC0.menu.pnum.GENERIC_C071R8TX.build.board=GENERIC_C071R8TX
GenC0.menu.pnum.GENERIC_C071R8TX.build.product_line=STM32C071xx
GenC0.menu.pnum.GENERIC_C071R8TX.build.variant=STM32C0xx/C071R(8-B)T
GenC0.menu.pnum.GENERIC_C071R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C071.svd

# Generic C071RBTx
GenC0.menu.pnum.GENERIC_C071RBTX=Generic C071RBTx
GenC0.menu.pnum.GENERIC_C071RBTX.upload.maximum_size=131072
GenC0.menu.pnum.GENERIC_C071RBTX.upload.maximum_data_size=24576
GenC0.menu.pnum.GENERIC_C071RBTX.build.board=GENERIC_C071RBTX
GenC0.menu.pnum.GENERIC_C071RBTX.build.product_line=STM32C071xx
GenC0.menu.pnum.GENERIC_C071RBTX.build.variant=STM32C0xx/C071R(8-B)T
GenC0.menu.pnum.GENERIC_C071RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32C0xx/STM32C071.svd

# Upload menu
GenC0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenC0.menu.upload_method.swdMethod.upload.protocol=swd
GenC0.menu.upload_method.swdMethod.upload.options=
GenC0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

