stm32duino/Arduino_Core_STM32/boards.txt
# Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX=Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBTX.build.board=GENERIC_F072CBTX
GenF0.menu.pnum.GENERIC_F072CBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBTX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F072CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX=Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8UX.build.board=GENERIC_F072C8UX
GenF0.menu.pnum.GENERIC_F072C8UX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8UX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F072C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX=Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBUX.build.board=GENERIC_F072CBUX
GenF0.menu.pnum.GENERIC_F072CBUX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBUX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F072CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX=Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBYX.build.board=GENERIC_F072CBYX
GenF0.menu.pnum.GENERIC_F072CBYX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBYX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F072CBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX=Generic F072R8Tx
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072R8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072R8TX.build.board=GENERIC_F072R8TX
GenF0.menu.pnum.GENERIC_F072R8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072R8TX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
GenF0.menu.pnum.GENERIC_F072R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX=Generic F072RBTx
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBTX.build.board=GENERIC_F072RBTX
GenF0.menu.pnum.GENERIC_F072RBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBTX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
GenF0.menu.pnum.GENERIC_F072RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX=Generic F072RBHx
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBHX.build.board=GENERIC_F072RBHX
GenF0.menu.pnum.GENERIC_F072RBHX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBHX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
GenF0.menu.pnum.GENERIC_F072RBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX=Generic F072RBIx
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072RBIX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072RBIX.build.board=GENERIC_F072RBIX
GenF0.menu.pnum.GENERIC_F072RBIX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072RBIX.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
GenF0.menu.pnum.GENERIC_F072RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072V8Hx
GenF0.menu.pnum.GENERIC_F072V8HX=Generic F072V8Hx
GenF0.menu.pnum.GENERIC_F072V8HX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072V8HX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072V8HX.build.board=GENERIC_F072V8HX
GenF0.menu.pnum.GENERIC_F072V8HX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072V8HX.build.variant=STM32F0xx/F072V(8-B)(H-T)
GenF0.menu.pnum.GENERIC_F072V8HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072VBHx
GenF0.menu.pnum.GENERIC_F072VBHX=Generic F072VBHx
GenF0.menu.pnum.GENERIC_F072VBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072VBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072VBHX.build.board=GENERIC_F072VBHX
GenF0.menu.pnum.GENERIC_F072VBHX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072VBHX.build.variant=STM32F0xx/F072V(8-B)(H-T)
GenF0.menu.pnum.GENERIC_F072VBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072V8Tx
GenF0.menu.pnum.GENERIC_F072V8TX=Generic F072V8Tx
GenF0.menu.pnum.GENERIC_F072V8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072V8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072V8TX.build.board=GENERIC_F072V8TX
GenF0.menu.pnum.GENERIC_F072V8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072V8TX.build.variant=STM32F0xx/F072V(8-B)(H-T)
GenF0.menu.pnum.GENERIC_F072V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F072VBTx
GenF0.menu.pnum.GENERIC_F072VBTX=Generic F072VBTx
GenF0.menu.pnum.GENERIC_F072VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072VBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072VBTX.build.board=GENERIC_F072VBTX
GenF0.menu.pnum.GENERIC_F072VBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072VBTX.build.variant=STM32F0xx/F072V(8-B)(H-T)
GenF0.menu.pnum.GENERIC_F072VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# Generic F078CBTx
GenF0.menu.pnum.GENERIC_F078CBTX=Generic F078CBTx
GenF0.menu.pnum.GENERIC_F078CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBTX.build.board=GENERIC_F078CBTX
GenF0.menu.pnum.GENERIC_F078CBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBTX.build.variant=STM32F0xx/F078CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F078CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

