stm32duino/Arduino_Core_STM32/boards.txt
# Generic F078CBUx
GenF0.menu.pnum.GENERIC_F078CBUX=Generic F078CBUx
GenF0.menu.pnum.GENERIC_F078CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBUX.build.board=GENERIC_F078CBUX
GenF0.menu.pnum.GENERIC_F078CBUX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBUX.build.variant=STM32F0xx/F078CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F078CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F078CBYx
GenF0.menu.pnum.GENERIC_F078CBYX=Generic F078CBYx
GenF0.menu.pnum.GENERIC_F078CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078CBYX.build.board=GENERIC_F078CBYX
GenF0.menu.pnum.GENERIC_F078CBYX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078CBYX.build.variant=STM32F0xx/F078CB(T-U-Y)
GenF0.menu.pnum.GENERIC_F078CBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F078RBHx
GenF0.menu.pnum.GENERIC_F078RBHX=Generic F078RBHx
GenF0.menu.pnum.GENERIC_F078RBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078RBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078RBHX.build.board=GENERIC_F078RBHX
GenF0.menu.pnum.GENERIC_F078RBHX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078RBHX.build.variant=STM32F0xx/F078RB(H-T)
GenF0.menu.pnum.GENERIC_F078RBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F078RBTx
GenF0.menu.pnum.GENERIC_F078RBTX=Generic F078RBTx
GenF0.menu.pnum.GENERIC_F078RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078RBTX.build.board=GENERIC_F078RBTX
GenF0.menu.pnum.GENERIC_F078RBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078RBTX.build.variant=STM32F0xx/F078RB(H-T)
GenF0.menu.pnum.GENERIC_F078RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F078VBHx
GenF0.menu.pnum.GENERIC_F078VBHX=Generic F078VBHx
GenF0.menu.pnum.GENERIC_F078VBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078VBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078VBHX.build.board=GENERIC_F078VBHX
GenF0.menu.pnum.GENERIC_F078VBHX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078VBHX.build.variant=STM32F0xx/F078VB(H-T)
GenF0.menu.pnum.GENERIC_F078VBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F078VBTx
GenF0.menu.pnum.GENERIC_F078VBTX=Generic F078VBTx
GenF0.menu.pnum.GENERIC_F078VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F078VBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F078VBTX.build.board=GENERIC_F078VBTX
GenF0.menu.pnum.GENERIC_F078VBTX.build.product_line=STM32F078xx
GenF0.menu.pnum.GENERIC_F078VBTX.build.variant=STM32F0xx/F078VB(H-T)
GenF0.menu.pnum.GENERIC_F078VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F091CBTx
GenF0.menu.pnum.GENERIC_F091CBTX=Generic F091CBTx
GenF0.menu.pnum.GENERIC_F091CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091CBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CBTX.build.board=GENERIC_F091CBTX
GenF0.menu.pnum.GENERIC_F091CBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CBTX.build.variant=STM32F0xx/F091C(B-C)(T-U)
GenF0.menu.pnum.GENERIC_F091CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091CCTx
GenF0.menu.pnum.GENERIC_F091CCTX=Generic F091CCTx
GenF0.menu.pnum.GENERIC_F091CCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091CCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CCTX.build.board=GENERIC_F091CCTX
GenF0.menu.pnum.GENERIC_F091CCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CCTX.build.variant=STM32F0xx/F091C(B-C)(T-U)
GenF0.menu.pnum.GENERIC_F091CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091CBUx
GenF0.menu.pnum.GENERIC_F091CBUX=Generic F091CBUx
GenF0.menu.pnum.GENERIC_F091CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091CBUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CBUX.build.board=GENERIC_F091CBUX
GenF0.menu.pnum.GENERIC_F091CBUX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CBUX.build.variant=STM32F0xx/F091C(B-C)(T-U)
GenF0.menu.pnum.GENERIC_F091CBUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091CCUx
GenF0.menu.pnum.GENERIC_F091CCUX=Generic F091CCUx
GenF0.menu.pnum.GENERIC_F091CCUX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091CCUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091CCUX.build.board=GENERIC_F091CCUX
GenF0.menu.pnum.GENERIC_F091CCUX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091CCUX.build.variant=STM32F0xx/F091C(B-C)(T-U)
GenF0.menu.pnum.GENERIC_F091CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX=Generic F091RBTx
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091RBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RBTX.build.board=GENERIC_F091RBTX
GenF0.menu.pnum.GENERIC_F091RBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RBTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F091RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX=Generic F091RCTx
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCTX.build.board=GENERIC_F091RCTX
GenF0.menu.pnum.GENERIC_F091RCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCTX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F091RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX=Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCHX.build.board=GENERIC_F091RCHX
GenF0.menu.pnum.GENERIC_F091RCHX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCHX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F091RCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

