stm32duino/Arduino_Core_STM32/boards.txt
# Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX=Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCYX.build.board=GENERIC_F091RCYX
GenF0.menu.pnum.GENERIC_F091RCYX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCYX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F091RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091VBTx
GenF0.menu.pnum.GENERIC_F091VBTX=Generic F091VBTx
GenF0.menu.pnum.GENERIC_F091VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091VBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VBTX.build.board=GENERIC_F091VBTX
GenF0.menu.pnum.GENERIC_F091VBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VBTX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)
GenF0.menu.pnum.GENERIC_F091VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091VCTx
GenF0.menu.pnum.GENERIC_F091VCTX=Generic F091VCTx
GenF0.menu.pnum.GENERIC_F091VCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091VCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VCTX.build.board=GENERIC_F091VCTX
GenF0.menu.pnum.GENERIC_F091VCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VCTX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)
GenF0.menu.pnum.GENERIC_F091VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F091VCHx
GenF0.menu.pnum.GENERIC_F091VCHX=Generic F091VCHx
GenF0.menu.pnum.GENERIC_F091VCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091VCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VCHX.build.board=GENERIC_F091VCHX
GenF0.menu.pnum.GENERIC_F091VCHX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VCHX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)
GenF0.menu.pnum.GENERIC_F091VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# Generic F098CCTx
GenF0.menu.pnum.GENERIC_F098CCTX=Generic F098CCTx
GenF0.menu.pnum.GENERIC_F098CCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098CCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098CCTX.build.board=GENERIC_F098CCTX
GenF0.menu.pnum.GENERIC_F098CCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098CCTX.build.variant=STM32F0xx/F098CC(T-U)
GenF0.menu.pnum.GENERIC_F098CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098CCUx
GenF0.menu.pnum.GENERIC_F098CCUX=Generic F098CCUx
GenF0.menu.pnum.GENERIC_F098CCUX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098CCUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098CCUX.build.board=GENERIC_F098CCUX
GenF0.menu.pnum.GENERIC_F098CCUX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098CCUX.build.variant=STM32F0xx/F098CC(T-U)
GenF0.menu.pnum.GENERIC_F098CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098RCHx
GenF0.menu.pnum.GENERIC_F098RCHX=Generic F098RCHx
GenF0.menu.pnum.GENERIC_F098RCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCHX.build.board=GENERIC_F098RCHX
GenF0.menu.pnum.GENERIC_F098RCHX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCHX.build.variant=STM32F0xx/F098RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F098RCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098RCTx
GenF0.menu.pnum.GENERIC_F098RCTX=Generic F098RCTx
GenF0.menu.pnum.GENERIC_F098RCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCTX.build.board=GENERIC_F098RCTX
GenF0.menu.pnum.GENERIC_F098RCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCTX.build.variant=STM32F0xx/F098RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F098RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098RCYx
GenF0.menu.pnum.GENERIC_F098RCYX=Generic F098RCYx
GenF0.menu.pnum.GENERIC_F098RCYX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCYX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCYX.build.board=GENERIC_F098RCYX
GenF0.menu.pnum.GENERIC_F098RCYX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCYX.build.variant=STM32F0xx/F098RC(H-T-Y)
GenF0.menu.pnum.GENERIC_F098RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098VCHx
GenF0.menu.pnum.GENERIC_F098VCHX=Generic F098VCHx
GenF0.menu.pnum.GENERIC_F098VCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098VCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098VCHX.build.board=GENERIC_F098VCHX
GenF0.menu.pnum.GENERIC_F098VCHX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098VCHX.build.variant=STM32F0xx/F098VC(H-T)
GenF0.menu.pnum.GENERIC_F098VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Generic F098VCTx
GenF0.menu.pnum.GENERIC_F098VCTX=Generic F098VCTx
GenF0.menu.pnum.GENERIC_F098VCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098VCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098VCTX.build.board=GENERIC_F098VCTX
GenF0.menu.pnum.GENERIC_F098VCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098VCTX.build.variant=STM32F0xx/F098VC(H-T)
GenF0.menu.pnum.GENERIC_F098VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x8.svd

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=swd
GenF0.menu.upload_method.swdMethod.upload.options=
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenF0.menu.upload_method.jlinkMethod.upload.options=
GenF0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=serial
GenF0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenF0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenF0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenF0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenF0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenF0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenF0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF1.build.flash_offset=0x0
GenF1.upload.maximum_size=0
GenF1.upload.maximum_data_size=0
GenF1.openocd.target=stm32f1x
GenF1.vid.0=0x0483
GenF1.pid.0=0x5740
# DFU mode on built-in bootloader not available, assuming using STM32duino-bootloader
GenF1.upload.vid.0=0x1eaf
GenF1.upload.pid.0=0x0003

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant_h=variant_{build.board}.h
GenF1.menu.pnum.BLUEPILL_F103C6.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

