stm32duino/Arduino_Core_STM32/boards.txt
# Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX=Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100C6TX.build.board=GENERIC_F100C6TX
GenF1.menu.pnum.GENERIC_F100C6TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C6TX.build.variant=STM32F1xx/F100C(4-6)T
GenF1.menu.pnum.GENERIC_F100C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX=Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100C8TX.build.board=GENERIC_F100C8TX
GenF1.menu.pnum.GENERIC_F100C8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C8TX.build.variant=STM32F1xx/F100C(8-B)T
GenF1.menu.pnum.GENERIC_F100C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX=Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100CBTX.build.board=GENERIC_F100CBTX
GenF1.menu.pnum.GENERIC_F100CBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100CBTX.build.variant=STM32F1xx/F100C(8-B)T
GenF1.menu.pnum.GENERIC_F100CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100R4Hx
GenF1.menu.pnum.GENERIC_F100R4HX=Generic F100R4Hx
GenF1.menu.pnum.GENERIC_F100R4HX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F100R4HX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100R4HX.build.board=GENERIC_F100R4HX
GenF1.menu.pnum.GENERIC_F100R4HX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100R4HX.build.variant=STM32F1xx/F100R(4-6)H
GenF1.menu.pnum.GENERIC_F100R4HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100R6Hx
GenF1.menu.pnum.GENERIC_F100R6HX=Generic F100R6Hx
GenF1.menu.pnum.GENERIC_F100R6HX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F100R6HX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100R6HX.build.board=GENERIC_F100R6HX
GenF1.menu.pnum.GENERIC_F100R6HX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100R6HX.build.variant=STM32F1xx/F100R(4-6)H
GenF1.menu.pnum.GENERIC_F100R6HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX=Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100R8TX.build.board=GENERIC_F100R8TX
GenF1.menu.pnum.GENERIC_F100R8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100R8TX.build.variant=STM32F1xx/F100R(8-B)T
GenF1.menu.pnum.GENERIC_F100R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX=Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100RBTX.build.board=GENERIC_F100RBTX
GenF1.menu.pnum.GENERIC_F100RBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100RBTX.build.variant=STM32F1xx/F100R(8-B)T
GenF1.menu.pnum.GENERIC_F100RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100V8Tx
GenF1.menu.pnum.GENERIC_F100V8TX=Generic F100V8Tx
GenF1.menu.pnum.GENERIC_F100V8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100V8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100V8TX.build.board=GENERIC_F100V8TX
GenF1.menu.pnum.GENERIC_F100V8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100V8TX.build.variant=STM32F1xx/F100V(8-B)T
GenF1.menu.pnum.GENERIC_F100V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100VBTx
GenF1.menu.pnum.GENERIC_F100VBTX=Generic F100VBTx
GenF1.menu.pnum.GENERIC_F100VBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100VBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100VBTX.build.board=GENERIC_F100VBTX
GenF1.menu.pnum.GENERIC_F100VBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100VBTX.build.variant=STM32F1xx/F100V(8-B)T
GenF1.menu.pnum.GENERIC_F100VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100ZCTx
GenF1.menu.pnum.GENERIC_F100ZCTX=Generic F100ZCTx
GenF1.menu.pnum.GENERIC_F100ZCTX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F100ZCTX.upload.maximum_data_size=24576
GenF1.menu.pnum.GENERIC_F100ZCTX.build.board=GENERIC_F100ZCTX
GenF1.menu.pnum.GENERIC_F100ZCTX.build.product_line=STM32F100xE
GenF1.menu.pnum.GENERIC_F100ZCTX.build.variant=STM32F1xx/F100Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F100ZCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100ZDTx
GenF1.menu.pnum.GENERIC_F100ZDTX=Generic F100ZDTx
GenF1.menu.pnum.GENERIC_F100ZDTX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F100ZDTX.upload.maximum_data_size=32768
GenF1.menu.pnum.GENERIC_F100ZDTX.build.board=GENERIC_F100ZDTX
GenF1.menu.pnum.GENERIC_F100ZDTX.build.product_line=STM32F100xE
GenF1.menu.pnum.GENERIC_F100ZDTX.build.variant=STM32F1xx/F100Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F100ZDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F100ZETx
GenF1.menu.pnum.GENERIC_F100ZETX=Generic F100ZETx
GenF1.menu.pnum.GENERIC_F100ZETX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F100ZETX.upload.maximum_data_size=32768
GenF1.menu.pnum.GENERIC_F100ZETX.build.board=GENERIC_F100ZETX
GenF1.menu.pnum.GENERIC_F100ZETX.build.product_line=STM32F100xE
GenF1.menu.pnum.GENERIC_F100ZETX.build.variant=STM32F1xx/F100Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F100ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F100.svd

# Generic F101C4Tx
GenF1.menu.pnum.GENERIC_F101C4TX=Generic F101C4Tx
GenF1.menu.pnum.GENERIC_F101C4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F101C4TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F101C4TX.build.board=GENERIC_F101C4TX
GenF1.menu.pnum.GENERIC_F101C4TX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101C4TX.build.variant=STM32F1xx/F101C(4-6)T
GenF1.menu.pnum.GENERIC_F101C4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

