stm32duino/Arduino_Core_STM32/boards.txt
# Generic F101C6Tx
GenF1.menu.pnum.GENERIC_F101C6TX=Generic F101C6Tx
GenF1.menu.pnum.GENERIC_F101C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F101C6TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F101C6TX.build.board=GENERIC_F101C6TX
GenF1.menu.pnum.GENERIC_F101C6TX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101C6TX.build.variant=STM32F1xx/F101C(4-6)T
GenF1.menu.pnum.GENERIC_F101C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101R4Tx
GenF1.menu.pnum.GENERIC_F101R4TX=Generic F101R4Tx
GenF1.menu.pnum.GENERIC_F101R4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F101R4TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F101R4TX.build.board=GENERIC_F101R4TX
GenF1.menu.pnum.GENERIC_F101R4TX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101R4TX.build.variant=STM32F1xx/F101R(4-6)T
GenF1.menu.pnum.GENERIC_F101R4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101R6Tx
GenF1.menu.pnum.GENERIC_F101R6TX=Generic F101R6Tx
GenF1.menu.pnum.GENERIC_F101R6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F101R6TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F101R6TX.build.board=GENERIC_F101R6TX
GenF1.menu.pnum.GENERIC_F101R6TX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101R6TX.build.variant=STM32F1xx/F101R(4-6)T
GenF1.menu.pnum.GENERIC_F101R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101T4Ux
GenF1.menu.pnum.GENERIC_F101T4UX=Generic F101T4Ux
GenF1.menu.pnum.GENERIC_F101T4UX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F101T4UX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F101T4UX.build.board=GENERIC_F101T4UX
GenF1.menu.pnum.GENERIC_F101T4UX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101T4UX.build.variant=STM32F1xx/F101T(4-6)U
GenF1.menu.pnum.GENERIC_F101T4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101T6Ux
GenF1.menu.pnum.GENERIC_F101T6UX=Generic F101T6Ux
GenF1.menu.pnum.GENERIC_F101T6UX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F101T6UX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F101T6UX.build.board=GENERIC_F101T6UX
GenF1.menu.pnum.GENERIC_F101T6UX.build.product_line=STM32F101x6
GenF1.menu.pnum.GENERIC_F101T6UX.build.variant=STM32F1xx/F101T(4-6)U
GenF1.menu.pnum.GENERIC_F101T6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101V8Tx
GenF1.menu.pnum.GENERIC_F101V8TX=Generic F101V8Tx
GenF1.menu.pnum.GENERIC_F101V8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F101V8TX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F101V8TX.build.board=GENERIC_F101V8TX
GenF1.menu.pnum.GENERIC_F101V8TX.build.product_line=STM32F101xB
GenF1.menu.pnum.GENERIC_F101V8TX.build.variant=STM32F1xx/F101V(8-B)T
GenF1.menu.pnum.GENERIC_F101V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101VBTx
GenF1.menu.pnum.GENERIC_F101VBTX=Generic F101VBTx
GenF1.menu.pnum.GENERIC_F101VBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F101VBTX.upload.maximum_data_size=16384
GenF1.menu.pnum.GENERIC_F101VBTX.build.board=GENERIC_F101VBTX
GenF1.menu.pnum.GENERIC_F101VBTX.build.product_line=STM32F101xB
GenF1.menu.pnum.GENERIC_F101VBTX.build.variant=STM32F1xx/F101V(8-B)T
GenF1.menu.pnum.GENERIC_F101VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101ZCTx
GenF1.menu.pnum.GENERIC_F101ZCTX=Generic F101ZCTx
GenF1.menu.pnum.GENERIC_F101ZCTX.upload.maximum_size=262144
GenF1.menu.pnum.GENERIC_F101ZCTX.upload.maximum_data_size=32768
GenF1.menu.pnum.GENERIC_F101ZCTX.build.board=GENERIC_F101ZCTX
GenF1.menu.pnum.GENERIC_F101ZCTX.build.product_line=STM32F101xE
GenF1.menu.pnum.GENERIC_F101ZCTX.build.variant=STM32F1xx/F101Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F101ZCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101ZDTx
GenF1.menu.pnum.GENERIC_F101ZDTX=Generic F101ZDTx
GenF1.menu.pnum.GENERIC_F101ZDTX.upload.maximum_size=393216
GenF1.menu.pnum.GENERIC_F101ZDTX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F101ZDTX.build.board=GENERIC_F101ZDTX
GenF1.menu.pnum.GENERIC_F101ZDTX.build.product_line=STM32F101xE
GenF1.menu.pnum.GENERIC_F101ZDTX.build.variant=STM32F1xx/F101Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F101ZDTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F101ZETx
GenF1.menu.pnum.GENERIC_F101ZETX=Generic F101ZETx
GenF1.menu.pnum.GENERIC_F101ZETX.upload.maximum_size=524288
GenF1.menu.pnum.GENERIC_F101ZETX.upload.maximum_data_size=49152
GenF1.menu.pnum.GENERIC_F101ZETX.build.board=GENERIC_F101ZETX
GenF1.menu.pnum.GENERIC_F101ZETX.build.product_line=STM32F101xE
GenF1.menu.pnum.GENERIC_F101ZETX.build.variant=STM32F1xx/F101Z(C-D-E)T
GenF1.menu.pnum.GENERIC_F101ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F101.svd

# Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX=Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103C4TX.build.board=GENERIC_F103C4TX
GenF1.menu.pnum.GENERIC_F103C4TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C4TX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.GENERIC_F103C4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103C6Tx
GenF1.menu.pnum.GENERIC_F103C6TX=Generic F103C6Tx
GenF1.menu.pnum.GENERIC_F103C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103C6TX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103C6TX.build.board=GENERIC_F103C6TX
GenF1.menu.pnum.GENERIC_F103C6TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C6TX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.GENERIC_F103C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103C6Ux
GenF1.menu.pnum.GENERIC_F103C6UX=Generic F103C6Ux
GenF1.menu.pnum.GENERIC_F103C6UX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103C6UX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103C6UX.build.board=GENERIC_F103C6UX
GenF1.menu.pnum.GENERIC_F103C6UX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C6UX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.GENERIC_F103C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Generic F103C8Tx
GenF1.menu.pnum.GENERIC_F103C8TX=Generic F103C8Tx
GenF1.menu.pnum.GENERIC_F103C8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103C8TX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103C8TX.build.board=GENERIC_F103C8TX
GenF1.menu.pnum.GENERIC_F103C8TX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103C8TX.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
GenF1.menu.pnum.GENERIC_F103C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

