stm32duino/Arduino_Core_STM32/boards.txt
# Generic F205RGEx
GenF2.menu.pnum.GENERIC_F205RGEX=Generic F205RGEx
GenF2.menu.pnum.GENERIC_F205RGEX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205RGEX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205RGEX.build.board=GENERIC_F205RGEX
GenF2.menu.pnum.GENERIC_F205RGEX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205RGEX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F205RGEX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205VBTx
GenF2.menu.pnum.GENERIC_F205VBTX=Generic F205VBTx
GenF2.menu.pnum.GENERIC_F205VBTX.upload.maximum_size=131072
GenF2.menu.pnum.GENERIC_F205VBTX.upload.maximum_data_size=65536
GenF2.menu.pnum.GENERIC_F205VBTX.build.board=GENERIC_F205VBTX
GenF2.menu.pnum.GENERIC_F205VBTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VBTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F205VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205VCTx
GenF2.menu.pnum.GENERIC_F205VCTX=Generic F205VCTx
GenF2.menu.pnum.GENERIC_F205VCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205VCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205VCTX.build.board=GENERIC_F205VCTX
GenF2.menu.pnum.GENERIC_F205VCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VCTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F205VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205VETx
GenF2.menu.pnum.GENERIC_F205VETX=Generic F205VETx
GenF2.menu.pnum.GENERIC_F205VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VETX.build.board=GENERIC_F205VETX
GenF2.menu.pnum.GENERIC_F205VETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VETX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F205VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205VFTx
GenF2.menu.pnum.GENERIC_F205VFTX=Generic F205VFTx
GenF2.menu.pnum.GENERIC_F205VFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205VFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VFTX.build.board=GENERIC_F205VFTX
GenF2.menu.pnum.GENERIC_F205VFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VFTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F205VFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205VGTx
GenF2.menu.pnum.GENERIC_F205VGTX=Generic F205VGTx
GenF2.menu.pnum.GENERIC_F205VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VGTX.build.board=GENERIC_F205VGTX
GenF2.menu.pnum.GENERIC_F205VGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VGTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F205VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205ZCTx
GenF2.menu.pnum.GENERIC_F205ZCTX=Generic F205ZCTx
GenF2.menu.pnum.GENERIC_F205ZCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205ZCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205ZCTX.build.board=GENERIC_F205ZCTX
GenF2.menu.pnum.GENERIC_F205ZCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZCTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F205ZCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205ZETx
GenF2.menu.pnum.GENERIC_F205ZETX=Generic F205ZETx
GenF2.menu.pnum.GENERIC_F205ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZETX.build.board=GENERIC_F205ZETX
GenF2.menu.pnum.GENERIC_F205ZETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZETX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F205ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205ZFTx
GenF2.menu.pnum.GENERIC_F205ZFTX=Generic F205ZFTx
GenF2.menu.pnum.GENERIC_F205ZFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205ZFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZFTX.build.board=GENERIC_F205ZFTX
GenF2.menu.pnum.GENERIC_F205ZFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZFTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F205ZFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F205ZGTx
GenF2.menu.pnum.GENERIC_F205ZGTX=Generic F205ZGTx
GenF2.menu.pnum.GENERIC_F205ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZGTX.build.board=GENERIC_F205ZGTX
GenF2.menu.pnum.GENERIC_F205ZGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZGTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F205ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F207ICHx
GenF2.menu.pnum.GENERIC_F207ICHX=Generic F207ICHx
GenF2.menu.pnum.GENERIC_F207ICHX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ICHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ICHX.build.board=GENERIC_F207ICHX
GenF2.menu.pnum.GENERIC_F207ICHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ICHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207ICHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F207IEHx
GenF2.menu.pnum.GENERIC_F207IEHX=Generic F207IEHx
GenF2.menu.pnum.GENERIC_F207IEHX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207IEHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IEHX.build.board=GENERIC_F207IEHX
GenF2.menu.pnum.GENERIC_F207IEHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IEHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F207IEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

