stm32duino/Arduino_Core_STM32/boards.txt
# Generic F207ZFTx
GenF2.menu.pnum.GENERIC_F207ZFTX=Generic F207ZFTx
GenF2.menu.pnum.GENERIC_F207ZFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207ZFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZFTX.build.board=GENERIC_F207ZFTX
GenF2.menu.pnum.GENERIC_F207ZFTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZFTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F207ZFTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F207ZGTx
GenF2.menu.pnum.GENERIC_F207ZGTX=Generic F207ZGTx
GenF2.menu.pnum.GENERIC_F207ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ZGTX.build.board=GENERIC_F207ZGTX
GenF2.menu.pnum.GENERIC_F207ZGTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ZGTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F207ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F215RETx
GenF2.menu.pnum.GENERIC_F215RETX=Generic F215RETx
GenF2.menu.pnum.GENERIC_F215RETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F215RETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215RETX.build.board=GENERIC_F215RETX
GenF2.menu.pnum.GENERIC_F215RETX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215RETX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F215RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F215RGTx
GenF2.menu.pnum.GENERIC_F215RGTX=Generic F215RGTx
GenF2.menu.pnum.GENERIC_F215RGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F215RGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215RGTX.build.board=GENERIC_F215RGTX
GenF2.menu.pnum.GENERIC_F215RGTX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215RGTX.build.variant=STM32F2xx/F205RE(T-Y)_F205R(B-C-F)T_F205RG(E-T-Y)_F215R(E-G)T
GenF2.menu.pnum.GENERIC_F215RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F215VETx
GenF2.menu.pnum.GENERIC_F215VETX=Generic F215VETx
GenF2.menu.pnum.GENERIC_F215VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F215VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215VETX.build.board=GENERIC_F215VETX
GenF2.menu.pnum.GENERIC_F215VETX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215VETX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F215VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F215VGTx
GenF2.menu.pnum.GENERIC_F215VGTX=Generic F215VGTx
GenF2.menu.pnum.GENERIC_F215VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F215VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215VGTX.build.board=GENERIC_F215VGTX
GenF2.menu.pnum.GENERIC_F215VGTX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215VGTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T
GenF2.menu.pnum.GENERIC_F215VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F215ZETx
GenF2.menu.pnum.GENERIC_F215ZETX=Generic F215ZETx
GenF2.menu.pnum.GENERIC_F215ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F215ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215ZETX.build.board=GENERIC_F215ZETX
GenF2.menu.pnum.GENERIC_F215ZETX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215ZETX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F215ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F215ZGTx
GenF2.menu.pnum.GENERIC_F215ZGTX=Generic F215ZGTx
GenF2.menu.pnum.GENERIC_F215ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F215ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F215ZGTX.build.board=GENERIC_F215ZGTX
GenF2.menu.pnum.GENERIC_F215ZGTX.build.product_line=STM32F215xx
GenF2.menu.pnum.GENERIC_F215ZGTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T
GenF2.menu.pnum.GENERIC_F215ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F215.svd

# Generic F217IEHx
GenF2.menu.pnum.GENERIC_F217IEHX=Generic F217IEHx
GenF2.menu.pnum.GENERIC_F217IEHX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217IEHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217IEHX.build.board=GENERIC_F217IEHX
GenF2.menu.pnum.GENERIC_F217IEHX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217IEHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F217IEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217IGHx
GenF2.menu.pnum.GENERIC_F217IGHX=Generic F217IGHx
GenF2.menu.pnum.GENERIC_F217IGHX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217IGHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217IGHX.build.board=GENERIC_F217IGHX
GenF2.menu.pnum.GENERIC_F217IGHX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217IGHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F217IGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217IETx
GenF2.menu.pnum.GENERIC_F217IETX=Generic F217IETx
GenF2.menu.pnum.GENERIC_F217IETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217IETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217IETX.build.board=GENERIC_F217IETX
GenF2.menu.pnum.GENERIC_F217IETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217IETX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F217IETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217IGTx
GenF2.menu.pnum.GENERIC_F217IGTX=Generic F217IGTx
GenF2.menu.pnum.GENERIC_F217IGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217IGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217IGTX.build.board=GENERIC_F217IGTX
GenF2.menu.pnum.GENERIC_F217IGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217IGTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)
GenF2.menu.pnum.GENERIC_F217IGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

