stm32duino/Arduino_Core_STM32/boards.txt
# Generic F217VETx
GenF2.menu.pnum.GENERIC_F217VETX=Generic F217VETx
GenF2.menu.pnum.GENERIC_F217VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217VETX.build.board=GENERIC_F217VETX
GenF2.menu.pnum.GENERIC_F217VETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217VETX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F217VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217VGTx
GenF2.menu.pnum.GENERIC_F217VGTX=Generic F217VGTx
GenF2.menu.pnum.GENERIC_F217VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217VGTX.build.board=GENERIC_F217VGTX
GenF2.menu.pnum.GENERIC_F217VGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217VGTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T
GenF2.menu.pnum.GENERIC_F217VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX=Generic F217ZETx
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F217ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZETX.build.board=GENERIC_F217ZETX
GenF2.menu.pnum.GENERIC_F217ZETX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZETX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F217ZETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX=Generic F217ZGTx
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F217ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F217ZGTX.build.board=GENERIC_F217ZGTX
GenF2.menu.pnum.GENERIC_F217ZGTX.build.product_line=STM32F217xx
GenF2.menu.pnum.GENERIC_F217ZGTX.build.variant=STM32F2xx/F207Z(C-E-F-G)T_F217Z(E-G)T
GenF2.menu.pnum.GENERIC_F217ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F2xx/STM32F217.svd

# Upload menu
GenF2.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF2.menu.upload_method.swdMethod.upload.protocol=swd
GenF2.menu.upload_method.swdMethod.upload.options=
GenF2.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF2.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenF2.menu.upload_method.jlinkMethod.upload.options=
GenF2.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF2.menu.upload_method.serialMethod.upload.protocol=serial
GenF2.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenF2.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF2.menu.upload_method.dfuMethod.upload.protocol=dfu
GenF2.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenF2.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF2.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenF2.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenF2.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenF2.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenF2.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenF2.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic F3

GenF3.name=Generic STM32F3 series

GenF3.build.core=arduino
GenF3.build.board=GenF3
GenF3.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF3.build.mcu=cortex-m4
GenF3.build.fpu=-mfpu=fpv4-sp-d16
GenF3.build.float-abi=-mfloat-abi=hard
GenF3.build.series=STM32F3xx
GenF3.build.flash_offset=0x0
GenF3.upload.maximum_size=0
GenF3.upload.maximum_data_size=0
GenF3.openocd.target=stm32f3x
GenF3.vid.0=0x0483
GenF3.pid.0=0x5740

# BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC=RobotDyn BlackPill F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_size=262144
GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_data_size=40960
GenF3.menu.pnum.BLACKPILL_F303CC.build.board=BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303CC.build.product_line=STM32F303xC
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant_h=variant_{build.board}.h
GenF3.menu.pnum.BLACKPILL_F303CC.build.variant=STM32F3xx/F303C(B-C)T
GenF3.menu.pnum.BLACKPILL_F303CC.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# OLIMEXINO_STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3=OLIMEXINO-STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3.upload.maximum_size=262144
GenF3.menu.pnum.OLIMEXINO_STM32F3.upload.maximum_data_size=40960
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.board=OLIMEXINO_STM32F3
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.product_line=STM32F303xC
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.variant_h=variant_{build.board}.h
GenF3.menu.pnum.OLIMEXINO_STM32F3.build.variant=STM32F3xx/F303R(B-C)T
GenF3.menu.pnum.OLIMEXINO_STM32F3.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F301C6Tx
GenF3.menu.pnum.GENERIC_F301C6TX=Generic F301C6Tx
GenF3.menu.pnum.GENERIC_F301C6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301C6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C6TX.build.board=GENERIC_F301C6TX
GenF3.menu.pnum.GENERIC_F301C6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C6TX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)
GenF3.menu.pnum.GENERIC_F301C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F301C8Tx
GenF3.menu.pnum.GENERIC_F301C8TX=Generic F301C8Tx
GenF3.menu.pnum.GENERIC_F301C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301C8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C8TX.build.board=GENERIC_F301C8TX
GenF3.menu.pnum.GENERIC_F301C8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C8TX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)
GenF3.menu.pnum.GENERIC_F301C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F301C8Yx
GenF3.menu.pnum.GENERIC_F301C8YX=Generic F301C8Yx
GenF3.menu.pnum.GENERIC_F301C8YX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301C8YX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301C8YX.build.board=GENERIC_F301C8YX
GenF3.menu.pnum.GENERIC_F301C8YX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301C8YX.build.variant=STM32F3xx/F301C6T_F301C8(T-Y)
GenF3.menu.pnum.GENERIC_F301C8YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F301K6Tx
GenF3.menu.pnum.GENERIC_F301K6TX=Generic F301K6Tx
GenF3.menu.pnum.GENERIC_F301K6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301K6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301K6TX.build.board=GENERIC_F301K6TX
GenF3.menu.pnum.GENERIC_F301K6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301K6TX.build.variant=STM32F3xx/F301K(6-8)T
GenF3.menu.pnum.GENERIC_F301K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

