stm32duino/Arduino_Core_STM32/boards.txt
# Generic F301K8Tx
GenF3.menu.pnum.GENERIC_F301K8TX=Generic F301K8Tx
GenF3.menu.pnum.GENERIC_F301K8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301K8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301K8TX.build.board=GENERIC_F301K8TX
GenF3.menu.pnum.GENERIC_F301K8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301K8TX.build.variant=STM32F3xx/F301K(6-8)T
GenF3.menu.pnum.GENERIC_F301K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F301R6Tx
GenF3.menu.pnum.GENERIC_F301R6TX=Generic F301R6Tx
GenF3.menu.pnum.GENERIC_F301R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F301R6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301R6TX.build.board=GENERIC_F301R6TX
GenF3.menu.pnum.GENERIC_F301R6TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301R6TX.build.variant=STM32F3xx/F301R(6-8)T
GenF3.menu.pnum.GENERIC_F301R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F301R8Tx
GenF3.menu.pnum.GENERIC_F301R8TX=Generic F301R8Tx
GenF3.menu.pnum.GENERIC_F301R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F301R8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F301R8TX.build.board=GENERIC_F301R8TX
GenF3.menu.pnum.GENERIC_F301R8TX.build.product_line=STM32F301x8
GenF3.menu.pnum.GENERIC_F301R8TX.build.variant=STM32F3xx/F301R(6-8)T
GenF3.menu.pnum.GENERIC_F301R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F301.svd

# Generic F302R6Tx
GenF3.menu.pnum.GENERIC_F302R6TX=Generic F302R6Tx
GenF3.menu.pnum.GENERIC_F302R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F302R6TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F302R6TX.build.board=GENERIC_F302R6TX
GenF3.menu.pnum.GENERIC_F302R6TX.build.product_line=STM32F302x8
GenF3.menu.pnum.GENERIC_F302R6TX.build.variant=STM32F3xx/F302R(6-8)T
GenF3.menu.pnum.GENERIC_F302R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F302.svd

# Generic F302R8Tx
GenF3.menu.pnum.GENERIC_F302R8TX=Generic F302R8Tx
GenF3.menu.pnum.GENERIC_F302R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F302R8TX.upload.maximum_data_size=16384
GenF3.menu.pnum.GENERIC_F302R8TX.build.board=GENERIC_F302R8TX
GenF3.menu.pnum.GENERIC_F302R8TX.build.product_line=STM32F302x8
GenF3.menu.pnum.GENERIC_F302R8TX.build.variant=STM32F3xx/F302R(6-8)T
GenF3.menu.pnum.GENERIC_F302R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F302.svd

# Generic F303C6Tx
GenF3.menu.pnum.GENERIC_F303C6TX=Generic F303C6Tx
GenF3.menu.pnum.GENERIC_F303C6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303C6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303C6TX.build.board=GENERIC_F303C6TX
GenF3.menu.pnum.GENERIC_F303C6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303C6TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T
GenF3.menu.pnum.GENERIC_F303C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303C8Tx
GenF3.menu.pnum.GENERIC_F303C8TX=Generic F303C8Tx
GenF3.menu.pnum.GENERIC_F303C8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303C8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303C8TX.build.board=GENERIC_F303C8TX
GenF3.menu.pnum.GENERIC_F303C8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303C8TX.build.variant=STM32F3xx/F303C(6-8)T_F334C(4-6-8)T
GenF3.menu.pnum.GENERIC_F303C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303CBTx
GenF3.menu.pnum.GENERIC_F303CBTX=Generic F303CBTx
GenF3.menu.pnum.GENERIC_F303CBTX.upload.maximum_size=131072
GenF3.menu.pnum.GENERIC_F303CBTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F303CBTX.build.board=GENERIC_F303CBTX
GenF3.menu.pnum.GENERIC_F303CBTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303CBTX.build.variant=STM32F3xx/F303C(B-C)T
GenF3.menu.pnum.GENERIC_F303CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303CCTx
GenF3.menu.pnum.GENERIC_F303CCTX=Generic F303CCTx
GenF3.menu.pnum.GENERIC_F303CCTX.upload.maximum_size=262144
GenF3.menu.pnum.GENERIC_F303CCTX.upload.maximum_data_size=40960
GenF3.menu.pnum.GENERIC_F303CCTX.build.board=GENERIC_F303CCTX
GenF3.menu.pnum.GENERIC_F303CCTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303CCTX.build.variant=STM32F3xx/F303C(B-C)T
GenF3.menu.pnum.GENERIC_F303CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303K6Tx
GenF3.menu.pnum.GENERIC_F303K6TX=Generic F303K6Tx
GenF3.menu.pnum.GENERIC_F303K6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303K6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303K6TX.build.board=GENERIC_F303K6TX
GenF3.menu.pnum.GENERIC_F303K6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303K6TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T
GenF3.menu.pnum.GENERIC_F303K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303K8Tx
GenF3.menu.pnum.GENERIC_F303K8TX=Generic F303K8Tx
GenF3.menu.pnum.GENERIC_F303K8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303K8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303K8TX.build.board=GENERIC_F303K8TX
GenF3.menu.pnum.GENERIC_F303K8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303K8TX.build.variant=STM32F3xx/F303K(6-8)T_F334K(4-6-8)T
GenF3.menu.pnum.GENERIC_F303K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303R6Tx
GenF3.menu.pnum.GENERIC_F303R6TX=Generic F303R6Tx
GenF3.menu.pnum.GENERIC_F303R6TX.upload.maximum_size=32768
GenF3.menu.pnum.GENERIC_F303R6TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303R6TX.build.board=GENERIC_F303R6TX
GenF3.menu.pnum.GENERIC_F303R6TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303R6TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T
GenF3.menu.pnum.GENERIC_F303R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303R8Tx
GenF3.menu.pnum.GENERIC_F303R8TX=Generic F303R8Tx
GenF3.menu.pnum.GENERIC_F303R8TX.upload.maximum_size=65536
GenF3.menu.pnum.GENERIC_F303R8TX.upload.maximum_data_size=12288
GenF3.menu.pnum.GENERIC_F303R8TX.build.board=GENERIC_F303R8TX
GenF3.menu.pnum.GENERIC_F303R8TX.build.product_line=STM32F303x8
GenF3.menu.pnum.GENERIC_F303R8TX.build.variant=STM32F3xx/F303R(6-8)T_F334R(6-8)T
GenF3.menu.pnum.GENERIC_F303R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Generic F303RBTx
GenF3.menu.pnum.GENERIC_F303RBTX=Generic F303RBTx
GenF3.menu.pnum.GENERIC_F303RBTX.upload.maximum_size=131072
GenF3.menu.pnum.GENERIC_F303RBTX.upload.maximum_data_size=32768
GenF3.menu.pnum.GENERIC_F303RBTX.build.board=GENERIC_F303RBTX
GenF3.menu.pnum.GENERIC_F303RBTX.build.product_line=STM32F303xC
GenF3.menu.pnum.GENERIC_F303RBTX.build.variant=STM32F3xx/F303R(B-C)T
GenF3.menu.pnum.GENERIC_F303RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

