stm32duino/Arduino_Core_STM32/boards.txt
# Generic F410RBIx
GenF4.menu.pnum.GENERIC_F410RBIX=Generic F410RBIx
GenF4.menu.pnum.GENERIC_F410RBIX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410RBIX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410RBIX.build.board=GENERIC_F410RBIX
GenF4.menu.pnum.GENERIC_F410RBIX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410RBIX.build.variant=STM32F4xx/F410R(8-B)(I-T)
GenF4.menu.pnum.GENERIC_F410RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F410.svd

# Generic F410R8Tx
GenF4.menu.pnum.GENERIC_F410R8TX=Generic F410R8Tx
GenF4.menu.pnum.GENERIC_F410R8TX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410R8TX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410R8TX.build.board=GENERIC_F410R8TX
GenF4.menu.pnum.GENERIC_F410R8TX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410R8TX.build.variant=STM32F4xx/F410R(8-B)(I-T)
GenF4.menu.pnum.GENERIC_F410R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F410.svd

# Generic F410RBTx
GenF4.menu.pnum.GENERIC_F410RBTX=Generic F410RBTx
GenF4.menu.pnum.GENERIC_F410RBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410RBTX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410RBTX.build.board=GENERIC_F410RBTX
GenF4.menu.pnum.GENERIC_F410RBTX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410RBTX.build.variant=STM32F4xx/F410R(8-B)(I-T)
GenF4.menu.pnum.GENERIC_F410RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F410.svd

# Generic F410T8Yx
GenF4.menu.pnum.GENERIC_F410T8YX=Generic F410T8Yx
GenF4.menu.pnum.GENERIC_F410T8YX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410T8YX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410T8YX.build.board=GENERIC_F410T8YX
GenF4.menu.pnum.GENERIC_F410T8YX.build.product_line=STM32F410Tx
GenF4.menu.pnum.GENERIC_F410T8YX.build.variant=STM32F4xx/F410T(8-B)Y
GenF4.menu.pnum.GENERIC_F410T8YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F410.svd

# Generic F410TBYx
GenF4.menu.pnum.GENERIC_F410TBYX=Generic F410TBYx
GenF4.menu.pnum.GENERIC_F410TBYX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410TBYX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410TBYX.build.board=GENERIC_F410TBYX
GenF4.menu.pnum.GENERIC_F410TBYX.build.product_line=STM32F410Tx
GenF4.menu.pnum.GENERIC_F410TBYX.build.variant=STM32F4xx/F410T(8-B)Y
GenF4.menu.pnum.GENERIC_F410TBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F410.svd

# Generic F411CCUx
GenF4.menu.pnum.GENERIC_F411CCUX=Generic F411CCUx
GenF4.menu.pnum.GENERIC_F411CCUX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411CCUX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CCUX.build.board=GENERIC_F411CCUX
GenF4.menu.pnum.GENERIC_F411CCUX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CCUX.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.GENERIC_F411CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F411CEUx
GenF4.menu.pnum.GENERIC_F411CEUX=Generic F411CEUx
GenF4.menu.pnum.GENERIC_F411CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411CEUX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CEUX.build.board=GENERIC_F411CEUX
GenF4.menu.pnum.GENERIC_F411CEUX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CEUX.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.GENERIC_F411CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F411CCYx
GenF4.menu.pnum.GENERIC_F411CCYX=Generic F411CCYx
GenF4.menu.pnum.GENERIC_F411CCYX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411CCYX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CCYX.build.board=GENERIC_F411CCYX
GenF4.menu.pnum.GENERIC_F411CCYX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CCYX.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.GENERIC_F411CCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F411CEYx
GenF4.menu.pnum.GENERIC_F411CEYX=Generic F411CEYx
GenF4.menu.pnum.GENERIC_F411CEYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411CEYX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CEYX.build.board=GENERIC_F411CEYX
GenF4.menu.pnum.GENERIC_F411CEYX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CEYX.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.GENERIC_F411CEYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F411RCTx
GenF4.menu.pnum.GENERIC_F411RCTX=Generic F411RCTx
GenF4.menu.pnum.GENERIC_F411RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411RCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411RCTX.build.board=GENERIC_F411RCTX
GenF4.menu.pnum.GENERIC_F411RCTX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411RCTX.build.variant=STM32F4xx/F411R(C-E)T
GenF4.menu.pnum.GENERIC_F411RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F411RETx
GenF4.menu.pnum.GENERIC_F411RETX=Generic F411RETx
GenF4.menu.pnum.GENERIC_F411RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411RETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411RETX.build.board=GENERIC_F411RETX
GenF4.menu.pnum.GENERIC_F411RETX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411RETX.build.variant=STM32F4xx/F411R(C-E)T
GenF4.menu.pnum.GENERIC_F411RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# Generic F412CEUx
GenF4.menu.pnum.GENERIC_F412CEUX=Generic F412CEUx
GenF4.menu.pnum.GENERIC_F412CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412CEUX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412CEUX.build.board=GENERIC_F412CEUX
GenF4.menu.pnum.GENERIC_F412CEUX.build.product_line=STM32F412Cx
GenF4.menu.pnum.GENERIC_F412CEUX.build.variant=STM32F4xx/F412C(E-G)U
GenF4.menu.pnum.GENERIC_F412CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

# Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX=Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412CGUX.build.board=GENERIC_F412CGUX
GenF4.menu.pnum.GENERIC_F412CGUX.build.product_line=STM32F412Cx
GenF4.menu.pnum.GENERIC_F412CGUX.build.variant=STM32F4xx/F412C(E-G)U
GenF4.menu.pnum.GENERIC_F412CGUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

# Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX=Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RETX.build.board=GENERIC_F412RETX
GenF4.menu.pnum.GENERIC_F412RETX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RETX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)
GenF4.menu.pnum.GENERIC_F412RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

# Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX=Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGTX.build.board=GENERIC_F412RGTX
GenF4.menu.pnum.GENERIC_F412RGTX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGTX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)
GenF4.menu.pnum.GENERIC_F412RGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

