stm32duino/Arduino_Core_STM32/boards.txt
# Generic F765IIKx
GenF7.menu.pnum.GENERIC_F765IIKX=Generic F765IIKx
GenF7.menu.pnum.GENERIC_F765IIKX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765IIKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IIKX.build.board=GENERIC_F765IIKX
GenF7.menu.pnum.GENERIC_F765IIKX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IIKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F765IIKX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765IGTx
GenF7.menu.pnum.GENERIC_F765IGTX=Generic F765IGTx
GenF7.menu.pnum.GENERIC_F765IGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765IGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IGTX.build.board=GENERIC_F765IGTX
GenF7.menu.pnum.GENERIC_F765IGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IGTX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F765IGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765IITx
GenF7.menu.pnum.GENERIC_F765IITX=Generic F765IITx
GenF7.menu.pnum.GENERIC_F765IITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765IITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IITX.build.board=GENERIC_F765IITX
GenF7.menu.pnum.GENERIC_F765IITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IITX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F765IITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765VGHx
GenF7.menu.pnum.GENERIC_F765VGHX=Generic F765VGHx
GenF7.menu.pnum.GENERIC_F765VGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765VGHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VGHX.build.board=GENERIC_F765VGHX
GenF7.menu.pnum.GENERIC_F765VGHX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VGHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
GenF7.menu.pnum.GENERIC_F765VGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765VGTx
GenF7.menu.pnum.GENERIC_F765VGTX=Generic F765VGTx
GenF7.menu.pnum.GENERIC_F765VGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765VGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VGTX.build.board=GENERIC_F765VGTX
GenF7.menu.pnum.GENERIC_F765VGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VGTX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
GenF7.menu.pnum.GENERIC_F765VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765VIHx
GenF7.menu.pnum.GENERIC_F765VIHX=Generic F765VIHx
GenF7.menu.pnum.GENERIC_F765VIHX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765VIHX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VIHX.build.board=GENERIC_F765VIHX
GenF7.menu.pnum.GENERIC_F765VIHX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VIHX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
GenF7.menu.pnum.GENERIC_F765VIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765VITx
GenF7.menu.pnum.GENERIC_F765VITX=Generic F765VITx
GenF7.menu.pnum.GENERIC_F765VITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765VITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765VITX.build.board=GENERIC_F765VITX
GenF7.menu.pnum.GENERIC_F765VITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765VITX.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
GenF7.menu.pnum.GENERIC_F765VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765ZGTx
GenF7.menu.pnum.GENERIC_F765ZGTX=Generic F765ZGTx
GenF7.menu.pnum.GENERIC_F765ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765ZGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765ZGTX.build.board=GENERIC_F765ZGTX
GenF7.menu.pnum.GENERIC_F765ZGTX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765ZGTX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT
GenF7.menu.pnum.GENERIC_F765ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F765ZITx
GenF7.menu.pnum.GENERIC_F765ZITX=Generic F765ZITx
GenF7.menu.pnum.GENERIC_F765ZITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F765ZITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765ZITX.build.board=GENERIC_F765ZITX
GenF7.menu.pnum.GENERIC_F765ZITX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765ZITX.build.variant=STM32F7xx/F765Z(G-I)T_F767Z(G-I)T_F777ZIT
GenF7.menu.pnum.GENERIC_F765ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# Generic F767IGKx
GenF7.menu.pnum.GENERIC_F767IGKX=Generic F767IGKx
GenF7.menu.pnum.GENERIC_F767IGKX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767IGKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IGKX.build.board=GENERIC_F767IGKX
GenF7.menu.pnum.GENERIC_F767IGKX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IGKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F767IGKX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F767.svd

# Generic F767IIKx
GenF7.menu.pnum.GENERIC_F767IIKX=Generic F767IIKx
GenF7.menu.pnum.GENERIC_F767IIKX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767IIKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IIKX.build.board=GENERIC_F767IIKX
GenF7.menu.pnum.GENERIC_F767IIKX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IIKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F767IIKX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F767.svd

# Generic F767IGTx
GenF7.menu.pnum.GENERIC_F767IGTX=Generic F767IGTx
GenF7.menu.pnum.GENERIC_F767IGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F767IGTX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IGTX.build.board=GENERIC_F767IGTX
GenF7.menu.pnum.GENERIC_F767IGTX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IGTX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F767IGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F767.svd

# Generic F767IITx
GenF7.menu.pnum.GENERIC_F767IITX=Generic F767IITx
GenF7.menu.pnum.GENERIC_F767IITX.upload.maximum_size=2097152
GenF7.menu.pnum.GENERIC_F767IITX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F767IITX.build.board=GENERIC_F767IITX
GenF7.menu.pnum.GENERIC_F767IITX.build.product_line=STM32F767xx
GenF7.menu.pnum.GENERIC_F767IITX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)
GenF7.menu.pnum.GENERIC_F767IITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F767.svd

