stm32duino/Arduino_Core_STM32/boards.txt
# Generic G031G4Ux
GenG0.menu.pnum.GENERIC_G031G4UX=Generic G031G4Ux
GenG0.menu.pnum.GENERIC_G031G4UX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031G4UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G4UX.build.board=GENERIC_G031G4UX
GenG0.menu.pnum.GENERIC_G031G4UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G4UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U
GenG0.menu.pnum.GENERIC_G031G4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G031G6Ux
GenG0.menu.pnum.GENERIC_G031G6UX=Generic G031G6Ux
GenG0.menu.pnum.GENERIC_G031G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031G6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G6UX.build.board=GENERIC_G031G6UX
GenG0.menu.pnum.GENERIC_G031G6UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G6UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U
GenG0.menu.pnum.GENERIC_G031G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G031G8Ux
GenG0.menu.pnum.GENERIC_G031G8UX=Generic G031G8Ux
GenG0.menu.pnum.GENERIC_G031G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031G8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031G8UX.build.board=GENERIC_G031G8UX
GenG0.menu.pnum.GENERIC_G031G8UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031G8UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U
GenG0.menu.pnum.GENERIC_G031G8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G041G6Ux
GenG0.menu.pnum.GENERIC_G041G6UX=Generic G041G6Ux
GenG0.menu.pnum.GENERIC_G041G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041G6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041G6UX.build.board=GENERIC_G041G6UX
GenG0.menu.pnum.GENERIC_G041G6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041G6UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U
GenG0.menu.pnum.GENERIC_G041G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041G8Ux
GenG0.menu.pnum.GENERIC_G041G8UX=Generic G041G8Ux
GenG0.menu.pnum.GENERIC_G041G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041G8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041G8UX.build.board=GENERIC_G041G8UX
GenG0.menu.pnum.GENERIC_G041G8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041G8UX.build.variant=STM32G0xx/G031G(4-6-8)U_G041G(6-8)U
GenG0.menu.pnum.GENERIC_G041G8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041C6Tx
GenG0.menu.pnum.GENERIC_G041C6TX=Generic G041C6Tx
GenG0.menu.pnum.GENERIC_G041C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041C6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C6TX.build.board=GENERIC_G041C6TX
GenG0.menu.pnum.GENERIC_G041C6TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C6TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G041C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041C8Tx
GenG0.menu.pnum.GENERIC_G041C8TX=Generic G041C8Tx
GenG0.menu.pnum.GENERIC_G041C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041C8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C8TX.build.board=GENERIC_G041C8TX
GenG0.menu.pnum.GENERIC_G041C8TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C8TX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G041C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041C6Ux
GenG0.menu.pnum.GENERIC_G041C6UX=Generic G041C6Ux
GenG0.menu.pnum.GENERIC_G041C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041C6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C6UX.build.board=GENERIC_G041C6UX
GenG0.menu.pnum.GENERIC_G041C6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C6UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G041C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041C8Ux
GenG0.menu.pnum.GENERIC_G041C8UX=Generic G041C8Ux
GenG0.menu.pnum.GENERIC_G041C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041C8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041C8UX.build.board=GENERIC_G041C8UX
GenG0.menu.pnum.GENERIC_G041C8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041C8UX.build.variant=STM32G0xx/G031C(4-6-8)(T-U)_G041C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G041C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX=Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J4MX.build.board=GENERIC_G031J4MX
GenG0.menu.pnum.GENERIC_G031J4MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J4MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M
GenG0.menu.pnum.GENERIC_G031J4MX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX=Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J6MX.build.board=GENERIC_G031J6MX
GenG0.menu.pnum.GENERIC_G031J6MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M
GenG0.menu.pnum.GENERIC_G031J6MX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX=Generic G031F4Px
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031F4PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F4PX.build.board=GENERIC_G031F4PX
GenG0.menu.pnum.GENERIC_G031F4PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F4PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y
GenG0.menu.pnum.GENERIC_G031F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

# Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX=Generic G031F6Px
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031F6PX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031F6PX.build.board=GENERIC_G031F6PX
GenG0.menu.pnum.GENERIC_G031F6PX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031F6PX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y
GenG0.menu.pnum.GENERIC_G031F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G031.svd

