stm32duino/Arduino_Core_STM32/boards.txt
# Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX=Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K8UX.build.board=GENERIC_G041K8UX
GenG0.menu.pnum.GENERIC_G041K8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K8UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G041K8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G041Y8Yx
GenG0.menu.pnum.GENERIC_G041Y8YX=Generic G041Y8Yx
GenG0.menu.pnum.GENERIC_G041Y8YX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041Y8YX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041Y8YX.build.board=GENERIC_G041Y8YX
GenG0.menu.pnum.GENERIC_G041Y8YX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041Y8YX.build.variant=STM32G0xx/G031F(4-6-8)P_G031Y8Y_G041F(6-8)P_G041Y8Y
GenG0.menu.pnum.GENERIC_G041Y8YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G041.svd

# Generic G050C6Tx
GenG0.menu.pnum.GENERIC_G050C6TX=Generic G050C6Tx
GenG0.menu.pnum.GENERIC_G050C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050C6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050C6TX.build.board=GENERIC_G050C6TX
GenG0.menu.pnum.GENERIC_G050C6TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050C6TX.build.variant=STM32G0xx/G050C(6-8)T
GenG0.menu.pnum.GENERIC_G050C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G050.svd

# Generic G050C8Tx
GenG0.menu.pnum.GENERIC_G050C8TX=Generic G050C8Tx
GenG0.menu.pnum.GENERIC_G050C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G050C8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050C8TX.build.board=GENERIC_G050C8TX
GenG0.menu.pnum.GENERIC_G050C8TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050C8TX.build.variant=STM32G0xx/G050C(6-8)T
GenG0.menu.pnum.GENERIC_G050C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G050.svd

# Generic G050F6Px
GenG0.menu.pnum.GENERIC_G050F6PX=Generic G050F6Px
GenG0.menu.pnum.GENERIC_G050F6PX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050F6PX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050F6PX.build.board=GENERIC_G050F6PX
GenG0.menu.pnum.GENERIC_G050F6PX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050F6PX.build.variant=STM32G0xx/G050F6P
GenG0.menu.pnum.GENERIC_G050F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G050.svd

# Generic G050K6Tx
GenG0.menu.pnum.GENERIC_G050K6TX=Generic G050K6Tx
GenG0.menu.pnum.GENERIC_G050K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G050K6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050K6TX.build.board=GENERIC_G050K6TX
GenG0.menu.pnum.GENERIC_G050K6TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050K6TX.build.variant=STM32G0xx/G050K(6-8)T
GenG0.menu.pnum.GENERIC_G050K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G050.svd

# Generic G050K8Tx
GenG0.menu.pnum.GENERIC_G050K8TX=Generic G050K8Tx
GenG0.menu.pnum.GENERIC_G050K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G050K8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G050K8TX.build.board=GENERIC_G050K8TX
GenG0.menu.pnum.GENERIC_G050K8TX.build.product_line=STM32G050xx
GenG0.menu.pnum.GENERIC_G050K8TX.build.variant=STM32G0xx/G050K(6-8)T
GenG0.menu.pnum.GENERIC_G050K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G050.svd

# Generic G051C6Tx
GenG0.menu.pnum.GENERIC_G051C6TX=Generic G051C6Tx
GenG0.menu.pnum.GENERIC_G051C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051C6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C6TX.build.board=GENERIC_G051C6TX
GenG0.menu.pnum.GENERIC_G051C6TX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C6TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051C8Tx
GenG0.menu.pnum.GENERIC_G051C8TX=Generic G051C8Tx
GenG0.menu.pnum.GENERIC_G051C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051C8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C8TX.build.board=GENERIC_G051C8TX
GenG0.menu.pnum.GENERIC_G051C8TX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C8TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051C6Ux
GenG0.menu.pnum.GENERIC_G051C6UX=Generic G051C6Ux
GenG0.menu.pnum.GENERIC_G051C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051C6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C6UX.build.board=GENERIC_G051C6UX
GenG0.menu.pnum.GENERIC_G051C6UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C6UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051C8Ux
GenG0.menu.pnum.GENERIC_G051C8UX=Generic G051C8Ux
GenG0.menu.pnum.GENERIC_G051C8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051C8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051C8UX.build.board=GENERIC_G051C8UX
GenG0.menu.pnum.GENERIC_G051C8UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051C8UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G061C6Tx
GenG0.menu.pnum.GENERIC_G061C6TX=Generic G061C6Tx
GenG0.menu.pnum.GENERIC_G061C6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061C6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C6TX.build.board=GENERIC_G061C6TX
GenG0.menu.pnum.GENERIC_G061C6TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C6TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061C8Tx
GenG0.menu.pnum.GENERIC_G061C8TX=Generic G061C8Tx
GenG0.menu.pnum.GENERIC_G061C8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061C8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C8TX.build.board=GENERIC_G061C8TX
GenG0.menu.pnum.GENERIC_G061C8TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C8TX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061C6Ux
GenG0.menu.pnum.GENERIC_G061C6UX=Generic G061C6Ux
GenG0.menu.pnum.GENERIC_G061C6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061C6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061C6UX.build.board=GENERIC_G061C6UX
GenG0.menu.pnum.GENERIC_G061C6UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061C6UX.build.variant=STM32G0xx/G051C(6-8)(T-U)_G061C(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

