stm32duino/Arduino_Core_STM32/boards.txt
# Generic G051K8Tx
GenG0.menu.pnum.GENERIC_G051K8TX=Generic G051K8Tx
GenG0.menu.pnum.GENERIC_G051K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051K8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051K8TX.build.board=GENERIC_G051K8TX
GenG0.menu.pnum.GENERIC_G051K8TX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051K8TX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051K6Ux
GenG0.menu.pnum.GENERIC_G051K6UX=Generic G051K6Ux
GenG0.menu.pnum.GENERIC_G051K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G051K6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051K6UX.build.board=GENERIC_G051K6UX
GenG0.menu.pnum.GENERIC_G051K6UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051K6UX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051K6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G051K8Ux
GenG0.menu.pnum.GENERIC_G051K8UX=Generic G051K8Ux
GenG0.menu.pnum.GENERIC_G051K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G051K8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G051K8UX.build.board=GENERIC_G051K8UX
GenG0.menu.pnum.GENERIC_G051K8UX.build.product_line=STM32G051xx
GenG0.menu.pnum.GENERIC_G051K8UX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G051K8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G051.svd

# Generic G061K6Tx
GenG0.menu.pnum.GENERIC_G061K6TX=Generic G061K6Tx
GenG0.menu.pnum.GENERIC_G061K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061K6TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061K6TX.build.board=GENERIC_G061K6TX
GenG0.menu.pnum.GENERIC_G061K6TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061K6TX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061K8Tx
GenG0.menu.pnum.GENERIC_G061K8TX=Generic G061K8Tx
GenG0.menu.pnum.GENERIC_G061K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061K8TX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061K8TX.build.board=GENERIC_G061K8TX
GenG0.menu.pnum.GENERIC_G061K8TX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061K8TX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061K6Ux
GenG0.menu.pnum.GENERIC_G061K6UX=Generic G061K6Ux
GenG0.menu.pnum.GENERIC_G061K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G061K6UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061K6UX.build.board=GENERIC_G061K6UX
GenG0.menu.pnum.GENERIC_G061K6UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061K6UX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061K6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G061K8Ux
GenG0.menu.pnum.GENERIC_G061K8UX=Generic G061K8Ux
GenG0.menu.pnum.GENERIC_G061K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G061K8UX.upload.maximum_data_size=18432
GenG0.menu.pnum.GENERIC_G061K8UX.build.board=GENERIC_G061K8UX
GenG0.menu.pnum.GENERIC_G061K8UX.build.product_line=STM32G061xx
GenG0.menu.pnum.GENERIC_G061K8UX.build.variant=STM32G0xx/G051K(6-8)(T-U)_G061K(6-8)(T-U)
GenG0.menu.pnum.GENERIC_G061K8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G061.svd

# Generic G070CBTx
GenG0.menu.pnum.GENERIC_G070CBTX=Generic G070CBTx
GenG0.menu.pnum.GENERIC_G070CBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G070CBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G070CBTX.build.board=GENERIC_G070CBTX
GenG0.menu.pnum.GENERIC_G070CBTX.build.product_line=STM32G070xx
GenG0.menu.pnum.GENERIC_G070CBTX.build.variant=STM32G0xx/G070CBT
GenG0.menu.pnum.GENERIC_G070CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G070.svd

# Generic G071EBYx
GenG0.menu.pnum.GENERIC_G071EBYX=Generic G071EBYx
GenG0.menu.pnum.GENERIC_G071EBYX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071EBYX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071EBYX.build.board=GENERIC_G071EBYX
GenG0.menu.pnum.GENERIC_G071EBYX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071EBYX.build.variant=STM32G0xx/G071EBY_G081EBY
GenG0.menu.pnum.GENERIC_G071EBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G081EBYx
GenG0.menu.pnum.GENERIC_G081EBYX=Generic G081EBYx
GenG0.menu.pnum.GENERIC_G081EBYX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081EBYX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081EBYX.build.board=GENERIC_G081EBYX
GenG0.menu.pnum.GENERIC_G081EBYX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081EBYX.build.variant=STM32G0xx/G071EBY_G081EBY
GenG0.menu.pnum.GENERIC_G081EBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G081.svd

# Generic G071G6Ux
GenG0.menu.pnum.GENERIC_G071G6UX=Generic G071G6Ux
GenG0.menu.pnum.GENERIC_G071G6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071G6UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071G6UX.build.board=GENERIC_G071G6UX
GenG0.menu.pnum.GENERIC_G071G6UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071G6UX.build.variant=STM32G0xx/G071G(6-8-B)U_G081GBU
GenG0.menu.pnum.GENERIC_G071G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

# Generic G071G8Ux
GenG0.menu.pnum.GENERIC_G071G8UX=Generic G071G8Ux
GenG0.menu.pnum.GENERIC_G071G8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071G8UX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071G8UX.build.board=GENERIC_G071G8UX
GenG0.menu.pnum.GENERIC_G071G8UX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071G8UX.build.variant=STM32G0xx/G071G(6-8-B)U_G081GBU
GenG0.menu.pnum.GENERIC_G071G8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G071.svd

