stm32duino/Arduino_Core_STM32/boards.txt
# Generic G0C1KCUx
GenG0.menu.pnum.GENERIC_G0C1KCUX=Generic G0C1KCUx
GenG0.menu.pnum.GENERIC_G0C1KCUX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1KCUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.board=GENERIC_G0C1KCUX
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KCUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1KCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1KEUx
GenG0.menu.pnum.GENERIC_G0C1KEUX=Generic G0C1KEUx
GenG0.menu.pnum.GENERIC_G0C1KEUX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1KEUX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.board=GENERIC_G0C1KEUX
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1KEUX.build.variant=STM32G0xx/G0B1K(B-C-E)(T-U)_G0C1K(C-E)(T-U)
GenG0.menu.pnum.GENERIC_G0C1KEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0B1MBTx
GenG0.menu.pnum.GENERIC_G0B1MBTX=Generic G0B1MBTx
GenG0.menu.pnum.GENERIC_G0B1MBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1MBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.board=GENERIC_G0B1MBTX
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1MBTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T
GenG0.menu.pnum.GENERIC_G0B1MBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1MCTx
GenG0.menu.pnum.GENERIC_G0B1MCTX=Generic G0B1MCTx
GenG0.menu.pnum.GENERIC_G0B1MCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1MCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.board=GENERIC_G0B1MCTX
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1MCTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T
GenG0.menu.pnum.GENERIC_G0B1MCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1METx
GenG0.menu.pnum.GENERIC_G0B1METX=Generic G0B1METx
GenG0.menu.pnum.GENERIC_G0B1METX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1METX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1METX.build.board=GENERIC_G0B1METX
GenG0.menu.pnum.GENERIC_G0B1METX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1METX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T
GenG0.menu.pnum.GENERIC_G0B1METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0C1MCTx
GenG0.menu.pnum.GENERIC_G0C1MCTX=Generic G0C1MCTx
GenG0.menu.pnum.GENERIC_G0C1MCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1MCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.board=GENERIC_G0C1MCTX
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1MCTX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T
GenG0.menu.pnum.GENERIC_G0C1MCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0C1METx
GenG0.menu.pnum.GENERIC_G0C1METX=Generic G0C1METx
GenG0.menu.pnum.GENERIC_G0C1METX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1METX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1METX.build.board=GENERIC_G0C1METX
GenG0.menu.pnum.GENERIC_G0C1METX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1METX.build.variant=STM32G0xx/G0B1M(B-C-E)T_G0C1M(C-E)T
GenG0.menu.pnum.GENERIC_G0C1METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0B1NEYx
GenG0.menu.pnum.GENERIC_G0B1NEYX=Generic G0B1NEYx
GenG0.menu.pnum.GENERIC_G0B1NEYX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1NEYX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.board=GENERIC_G0B1NEYX
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1NEYX.build.variant=STM32G0xx/G0B1NEY_G0C1NEY
GenG0.menu.pnum.GENERIC_G0B1NEYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0C1NEYx
GenG0.menu.pnum.GENERIC_G0C1NEYX=Generic G0C1NEYx
GenG0.menu.pnum.GENERIC_G0C1NEYX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1NEYX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.board=GENERIC_G0C1NEYX
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.variant=STM32G0xx/G0B1NEY_G0C1NEY
GenG0.menu.pnum.GENERIC_G0C1NEYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0C1.svd

# Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX=Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.board=GENERIC_G0B1RBTX
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T
GenG0.menu.pnum.GENERIC_G0B1RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX=Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.board=GENERIC_G0B1RCTX
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T
GenG0.menu.pnum.GENERIC_G0B1RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX=Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RETX.build.board=GENERIC_G0B1RETX
GenG0.menu.pnum.GENERIC_G0B1RETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RETX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T
GenG0.menu.pnum.GENERIC_G0B1RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1VBIx
GenG0.menu.pnum.GENERIC_G0B1VBIX=Generic G0B1VBIx
GenG0.menu.pnum.GENERIC_G0B1VBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1VBIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.board=GENERIC_G0B1VBIX
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# Generic G0B1VCIx
GenG0.menu.pnum.GENERIC_G0B1VCIX=Generic G0B1VCIx
GenG0.menu.pnum.GENERIC_G0B1VCIX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1VCIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.board=GENERIC_G0B1VCIX
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)
GenG0.menu.pnum.GENERIC_G0B1VCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

