stm32duino/Arduino_Core_STM32/boards.txt
# Generic G474RCTx
GenG4.menu.pnum.GENERIC_G474RCTX=Generic G474RCTx
GenG4.menu.pnum.GENERIC_G474RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RCTX.build.board=GENERIC_G474RCTX
GenG4.menu.pnum.GENERIC_G474RCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RCTX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G474RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474RETx
GenG4.menu.pnum.GENERIC_G474RETX=Generic G474RETx
GenG4.menu.pnum.GENERIC_G474RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RETX.build.board=GENERIC_G474RETX
GenG4.menu.pnum.GENERIC_G474RETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RETX.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G474RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G473RETxZ
GenG4.menu.pnum.GENERIC_G473RETXZ=Generic G473RETxZ
GenG4.menu.pnum.GENERIC_G473RETXZ.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473RETXZ.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473RETXZ.build.board=GENERIC_G473RETXZ
GenG4.menu.pnum.GENERIC_G473RETXZ.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473RETXZ.build.variant=STM32G4xx/G473R(B-C)T_G473RETx(Z)_G474R(B-C-E)T_G483RET_G484RET
GenG4.menu.pnum.GENERIC_G473RETXZ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G473.svd

# Generic G474QBTx
GenG4.menu.pnum.GENERIC_G474QBTX=Generic G474QBTx
GenG4.menu.pnum.GENERIC_G474QBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474QBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QBTX.build.board=GENERIC_G474QBTX
GenG4.menu.pnum.GENERIC_G474QBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QBTX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G474QBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474QCTx
GenG4.menu.pnum.GENERIC_G474QCTX=Generic G474QCTx
GenG4.menu.pnum.GENERIC_G474QCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474QCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QCTX.build.board=GENERIC_G474QCTX
GenG4.menu.pnum.GENERIC_G474QCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QCTX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G474QCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474QETx
GenG4.menu.pnum.GENERIC_G474QETX=Generic G474QETx
GenG4.menu.pnum.GENERIC_G474QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QETX.build.board=GENERIC_G474QETX
GenG4.menu.pnum.GENERIC_G474QETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QETX.build.variant=STM32G4xx/G473Q(B-C)T_G473QETx(Z)_G474Q(B-C-E)T_G483QET_G484QET
GenG4.menu.pnum.GENERIC_G474QETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VBHx
GenG4.menu.pnum.GENERIC_G474VBHX=Generic G474VBHx
GenG4.menu.pnum.GENERIC_G474VBHX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474VBHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VBHX.build.board=GENERIC_G474VBHX
GenG4.menu.pnum.GENERIC_G474VBHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VBHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VBHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VCHx
GenG4.menu.pnum.GENERIC_G474VCHX=Generic G474VCHx
GenG4.menu.pnum.GENERIC_G474VCHX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474VCHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VCHX.build.board=GENERIC_G474VCHX
GenG4.menu.pnum.GENERIC_G474VCHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VCHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VCHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VEHx
GenG4.menu.pnum.GENERIC_G474VEHX=Generic G474VEHx
GenG4.menu.pnum.GENERIC_G474VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VEHX.build.board=GENERIC_G474VEHX
GenG4.menu.pnum.GENERIC_G474VEHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VEHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VBTx
GenG4.menu.pnum.GENERIC_G474VBTX=Generic G474VBTx
GenG4.menu.pnum.GENERIC_G474VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474VBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VBTX.build.board=GENERIC_G474VBTX
GenG4.menu.pnum.GENERIC_G474VBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VBTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VCTx
GenG4.menu.pnum.GENERIC_G474VCTX=Generic G474VCTx
GenG4.menu.pnum.GENERIC_G474VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VCTX.build.board=GENERIC_G474VCTX
GenG4.menu.pnum.GENERIC_G474VCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VCTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G474VETx
GenG4.menu.pnum.GENERIC_G474VETX=Generic G474VETx
GenG4.menu.pnum.GENERIC_G474VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VETX.build.board=GENERIC_G474VETX
GenG4.menu.pnum.GENERIC_G474VETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)
GenG4.menu.pnum.GENERIC_G474VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G474.svd

# Generic G483CETx
GenG4.menu.pnum.GENERIC_G483CETX=Generic G483CETx
GenG4.menu.pnum.GENERIC_G483CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483CETX.build.board=GENERIC_G483CETX
GenG4.menu.pnum.GENERIC_G483CETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET
GenG4.menu.pnum.GENERIC_G483CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G483.svd

# Generic G483METx
GenG4.menu.pnum.GENERIC_G483METX=Generic G483METx
GenG4.menu.pnum.GENERIC_G483METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483METX.build.board=GENERIC_G483METX
GenG4.menu.pnum.GENERIC_G483METX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET
GenG4.menu.pnum.GENERIC_G483METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G483.svd

