stm32duino/Arduino_Core_STM32/boards.txt
# Generic G4A1CETx
GenG4.menu.pnum.GENERIC_G4A1CETX=Generic G4A1CETx
GenG4.menu.pnum.GENERIC_G4A1CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1CETX.build.board=GENERIC_G4A1CETX
GenG4.menu.pnum.GENERIC_G4A1CETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1CETX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET
GenG4.menu.pnum.GENERIC_G4A1CETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1KEUx
GenG4.menu.pnum.GENERIC_G4A1KEUX=Generic G4A1KEUx
GenG4.menu.pnum.GENERIC_G4A1KEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1KEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.board=GENERIC_G4A1KEUX
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU
GenG4.menu.pnum.GENERIC_G4A1KEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1MESx
GenG4.menu.pnum.GENERIC_G4A1MESX=Generic G4A1MESx
GenG4.menu.pnum.GENERIC_G4A1MESX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1MESX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1MESX.build.board=GENERIC_G4A1MESX
GenG4.menu.pnum.GENERIC_G4A1MESX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1MESX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G4A1MESX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1METx
GenG4.menu.pnum.GENERIC_G4A1METX=Generic G4A1METx
GenG4.menu.pnum.GENERIC_G4A1METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1METX.build.board=GENERIC_G4A1METX
GenG4.menu.pnum.GENERIC_G4A1METX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1METX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)
GenG4.menu.pnum.GENERIC_G4A1METX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX=Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1RETX.build.board=GENERIC_G4A1RETX
GenG4.menu.pnum.GENERIC_G4A1RETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G4A1RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX=Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REYX.build.board=GENERIC_G4A1REYX
GenG4.menu.pnum.GENERIC_G4A1REYX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)x(Z)_G4A1RE(I-T-Y)
GenG4.menu.pnum.GENERIC_G4A1REYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Generic G4A1VETx
GenG4.menu.pnum.GENERIC_G4A1VETX=Generic G4A1VETx
GenG4.menu.pnum.GENERIC_G4A1VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1VETX.build.board=GENERIC_G4A1VETX
GenG4.menu.pnum.GENERIC_G4A1VETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1VETX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET
GenG4.menu.pnum.GENERIC_G4A1VETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G4xx/STM32G4A1.svd

# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=swd
GenG4.menu.upload_method.swdMethod.upload.options=
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenG4.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenG4.menu.upload_method.jlinkMethod.upload.options=
GenG4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=serial
GenG4.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=dfu
GenG4.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenG4.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenG4.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenG4.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenG4.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenG4.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic H5
GenH5.name=Generic STM32H5 series

GenH5.build.core=arduino
GenH5.build.board=GenH5
GenH5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH5.build.mcu=cortex-m33
GenH5.build.fpu=-mfpu=fpv4-sp-d16
GenH5.build.float-abi=-mfloat-abi=hard
GenH5.build.series=STM32H5xx
GenH5.build.flash_offset=0x0
GenH5.upload.maximum_size=0
GenH5.upload.maximum_data_size=0
# Current openocd version does not support H5
# GenH5.openocd.target=stm32h5x
GenH5.vid.0=0x0483
GenH5.pid.0=0x5740

# WeAct H562RGT
GenH5.menu.pnum.WEACT_H562RG=WeAct H562RGT
GenH5.menu.pnum.WEACT_H562RG.upload.maximum_size=1048576
GenH5.menu.pnum.WEACT_H562RG.upload.maximum_data_size=655360
GenH5.menu.pnum.WEACT_H562RG.build.board=WEACT_H562RG
GenH5.menu.pnum.WEACT_H562RG.build.product_line=STM32H562xx
GenH5.menu.pnum.WEACT_H562RG.build.variant=STM32H5xx/H562R(G-I)T
GenH5.menu.pnum.WEACT_H562RG.build.variant_h=variant_WEACT_H562RG.h
GenH5.menu.pnum.WEACT_H562RG.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH5.menu.pnum.WEACT_H562RG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H562.svd

# Generic H503CBTx
GenH5.menu.pnum.GENERIC_H503CBTX=Generic H503CBTx
GenH5.menu.pnum.GENERIC_H503CBTX.upload.maximum_size=131072
GenH5.menu.pnum.GENERIC_H503CBTX.upload.maximum_data_size=32768
GenH5.menu.pnum.GENERIC_H503CBTX.build.board=GENERIC_H503CBTX
GenH5.menu.pnum.GENERIC_H503CBTX.build.product_line=STM32H503xx
GenH5.menu.pnum.GENERIC_H503CBTX.build.variant=STM32H5xx/H503CB(T-U)
GenH5.menu.pnum.GENERIC_H503CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H5xx/STM32H503.svd

