stm32duino/Arduino_Core_STM32/boards.txt
# Generic H7A3VITx
GenH7.menu.pnum.GENERIC_H7A3VITX=Generic H7A3VITx
GenH7.menu.pnum.GENERIC_H7A3VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H7A3VITX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7A3VITX.build.board=GENERIC_H7A3VITX
GenH7.menu.pnum.GENERIC_H7A3VITX.build.product_line=STM32H7A3xx
GenH7.menu.pnum.GENERIC_H7A3VITX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7A3VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7A3.svd

# Generic H7B0VBTx
GenH7.menu.pnum.GENERIC_H7B0VBTX=Generic H7B0VBTx
GenH7.menu.pnum.GENERIC_H7B0VBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H7B0VBTX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7B0VBTX.build.board=GENERIC_H7B0VBTX
GenH7.menu.pnum.GENERIC_H7B0VBTX.build.product_line=STM32H7B0xx
GenH7.menu.pnum.GENERIC_H7B0VBTX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7B0VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7B0.svd

# Generic H7B3VIHx
GenH7.menu.pnum.GENERIC_H7B3VIHX=Generic H7B3VIHx
GenH7.menu.pnum.GENERIC_H7B3VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H7B3VIHX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7B3VIHX.build.board=GENERIC_H7B3VIHX
GenH7.menu.pnum.GENERIC_H7B3VIHX.build.product_line=STM32H7B3xx
GenH7.menu.pnum.GENERIC_H7B3VIHX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7B3VIHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7B3.svd

# Generic H7B3VITx
GenH7.menu.pnum.GENERIC_H7B3VITX=Generic H7B3VITx
GenH7.menu.pnum.GENERIC_H7B3VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H7B3VITX.upload.maximum_data_size=1048576
GenH7.menu.pnum.GENERIC_H7B3VITX.build.board=GENERIC_H7B3VITX
GenH7.menu.pnum.GENERIC_H7B3VITX.build.product_line=STM32H7B3xx
GenH7.menu.pnum.GENERIC_H7B3VITX.build.variant=STM32H7xx/H7A3V(G-I)(H-T)_H7B0VBT_H7B3VI(H-T)
GenH7.menu.pnum.GENERIC_H7B3VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32H7xx/STM32H7B3.svd

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=swd
GenH7.menu.upload_method.swdMethod.upload.options=
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenH7.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenH7.menu.upload_method.jlinkMethod.upload.options=
GenH7.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=serial
GenH7.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=dfu
GenH7.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenH7.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenH7.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenH7.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenH7.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenH7.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic L0
GenL0.name=Generic STM32L0 series

GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.flash_offset=0x0
GenL0.upload.maximum_size=0
GenL0.upload.maximum_data_size=0
GenL0.openocd.target=stm32l0
GenL0.vid.0=0x0483
GenL0.pid.0=0x5740

# ThunderPack
GenL0.menu.pnum.THUNDERPACK_L072=ThunderPack v1.0
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_size=196608
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDERPACK_L072.build.board=THUNDERPACK_L072
GenL0.menu.pnum.THUNDERPACK_L072.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDERPACK_L072.build.variant_h=variant_{build.board}.h
GenL0.menu.pnum.THUNDERPACK_L072.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenL0.menu.pnum.THUNDERPACK_L072.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T
GenL0.menu.pnum.THUNDERPACK_L072.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Piconomix PX-HER0 board
GenL0.menu.pnum.PX_HER0=PX-HER0
GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
GenL0.menu.pnum.PX_HER0.build.variant_h=variant_{build.board}.h
GenL0.menu.pnum.PX_HER0.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.PX_HER0.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenL0.menu.pnum.PX_HER0.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x2.svd

# Generic L010C6Tx
GenL0.menu.pnum.GENERIC_L010C6TX=Generic L010C6Tx
GenL0.menu.pnum.GENERIC_L010C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L010C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L010C6TX.build.board=GENERIC_L010C6TX
GenL0.menu.pnum.GENERIC_L010C6TX.build.product_line=STM32L010x6
GenL0.menu.pnum.GENERIC_L010C6TX.build.variant=STM32L0xx/L010C6T
GenL0.menu.pnum.GENERIC_L010C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x0.svd

# Generic L010F4Px
GenL0.menu.pnum.GENERIC_L010F4PX=Generic L010F4Px
GenL0.menu.pnum.GENERIC_L010F4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L010F4PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L010F4PX.build.board=GENERIC_L010F4PX
GenL0.menu.pnum.GENERIC_L010F4PX.build.product_line=STM32L010x4
GenL0.menu.pnum.GENERIC_L010F4PX.build.variant=STM32L0xx/L010F4P_L011F(3-4)P_L021F4P
GenL0.menu.pnum.GENERIC_L010F4PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x0.svd

