stm32duino/Arduino_Core_STM32/boards.txt
# Generic L031F6Px
GenL0.menu.pnum.GENERIC_L031F6PX=Generic L031F6Px
GenL0.menu.pnum.GENERIC_L031F6PX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031F6PX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031F6PX.build.board=GENERIC_L031F6PX
GenL0.menu.pnum.GENERIC_L031F6PX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031F6PX.build.variant=STM32L0xx/L031F(4-6)P_L041F6P
GenL0.menu.pnum.GENERIC_L031F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L031G4Ux
GenL0.menu.pnum.GENERIC_L031G4UX=Generic L031G4Ux
GenL0.menu.pnum.GENERIC_L031G4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031G4UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031G4UX.build.board=GENERIC_L031G4UX
GenL0.menu.pnum.GENERIC_L031G4UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031G4UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U
GenL0.menu.pnum.GENERIC_L031G4UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L031G6Ux
GenL0.menu.pnum.GENERIC_L031G6UX=Generic L031G6Ux
GenL0.menu.pnum.GENERIC_L031G6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031G6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031G6UX.build.board=GENERIC_L031G6UX
GenL0.menu.pnum.GENERIC_L031G6UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031G6UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U
GenL0.menu.pnum.GENERIC_L031G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX=Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K4TX.build.board=GENERIC_L031K4TX
GenL0.menu.pnum.GENERIC_L031K4TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K4TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T
GenL0.menu.pnum.GENERIC_L031K4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX=Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K6TX.build.board=GENERIC_L031K6TX
GenL0.menu.pnum.GENERIC_L031K6TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T
GenL0.menu.pnum.GENERIC_L031K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041C4Tx
GenL0.menu.pnum.GENERIC_L041C4TX=Generic L041C4Tx
GenL0.menu.pnum.GENERIC_L041C4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L041C4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C4TX.build.board=GENERIC_L041C4TX
GenL0.menu.pnum.GENERIC_L041C4TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C4TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)
GenL0.menu.pnum.GENERIC_L041C4TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041C6Tx
GenL0.menu.pnum.GENERIC_L041C6TX=Generic L041C6Tx
GenL0.menu.pnum.GENERIC_L041C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C6TX.build.board=GENERIC_L041C6TX
GenL0.menu.pnum.GENERIC_L041C6TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C6TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)
GenL0.menu.pnum.GENERIC_L041C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041C6Ux
GenL0.menu.pnum.GENERIC_L041C6UX=Generic L041C6Ux
GenL0.menu.pnum.GENERIC_L041C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041C6UX.build.board=GENERIC_L041C6UX
GenL0.menu.pnum.GENERIC_L041C6UX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041C6UX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)
GenL0.menu.pnum.GENERIC_L041C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041E6Yx
GenL0.menu.pnum.GENERIC_L041E6YX=Generic L041E6Yx
GenL0.menu.pnum.GENERIC_L041E6YX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041E6YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041E6YX.build.board=GENERIC_L041E6YX
GenL0.menu.pnum.GENERIC_L041E6YX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041E6YX.build.variant=STM32L0xx/L031E(4-6)Y_L041E6Y
GenL0.menu.pnum.GENERIC_L041E6YX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041F6Px
GenL0.menu.pnum.GENERIC_L041F6PX=Generic L041F6Px
GenL0.menu.pnum.GENERIC_L041F6PX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041F6PX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041F6PX.build.board=GENERIC_L041F6PX
GenL0.menu.pnum.GENERIC_L041F6PX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041F6PX.build.variant=STM32L0xx/L031F(4-6)P_L041F6P
GenL0.menu.pnum.GENERIC_L041F6PX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041G6Ux
GenL0.menu.pnum.GENERIC_L041G6UX=Generic L041G6Ux
GenL0.menu.pnum.GENERIC_L041G6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041G6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041G6UX.build.board=GENERIC_L041G6UX
GenL0.menu.pnum.GENERIC_L041G6UX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041G6UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U
GenL0.menu.pnum.GENERIC_L041G6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX=Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041K6TX.build.board=GENERIC_L041K6TX
GenL0.menu.pnum.GENERIC_L041K6TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T
GenL0.menu.pnum.GENERIC_L041K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX=Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6TX.build.board=GENERIC_L051C6TX
GenL0.menu.pnum.GENERIC_L051C6TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6TX.build.variant=STM32L0xx/L051C(6-8)(T-U)
GenL0.menu.pnum.GENERIC_L051C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX=Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6UX.build.board=GENERIC_L051C6UX
GenL0.menu.pnum.GENERIC_L051C6UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6UX.build.variant=STM32L0xx/L051C(6-8)(T-U)
GenL0.menu.pnum.GENERIC_L051C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX=Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8TX.build.board=GENERIC_L051C8TX
GenL0.menu.pnum.GENERIC_L051C8TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8TX.build.variant=STM32L0xx/L051C(6-8)(T-U)
GenL0.menu.pnum.GENERIC_L051C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

