stm32duino/Arduino_Core_STM32/boards.txt
# Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX=Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8UX.build.board=GENERIC_L051C8UX
GenL0.menu.pnum.GENERIC_L051C8UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8UX.build.variant=STM32L0xx/L051C(6-8)(T-U)
GenL0.menu.pnum.GENERIC_L051C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051K6Tx
GenL0.menu.pnum.GENERIC_L051K6TX=Generic L051K6Tx
GenL0.menu.pnum.GENERIC_L051K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051K6TX.build.board=GENERIC_L051K6TX
GenL0.menu.pnum.GENERIC_L051K6TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051K6TX.build.variant=STM32L0xx/L051K(6-8)T
GenL0.menu.pnum.GENERIC_L051K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051K6Ux
GenL0.menu.pnum.GENERIC_L051K6UX=Generic L051K6Ux
GenL0.menu.pnum.GENERIC_L051K6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051K6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051K6UX.build.board=GENERIC_L051K6UX
GenL0.menu.pnum.GENERIC_L051K6UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051K6UX.build.variant=STM32L0xx/L051K(6-8)U
GenL0.menu.pnum.GENERIC_L051K6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051K8Tx
GenL0.menu.pnum.GENERIC_L051K8TX=Generic L051K8Tx
GenL0.menu.pnum.GENERIC_L051K8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051K8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051K8TX.build.board=GENERIC_L051K8TX
GenL0.menu.pnum.GENERIC_L051K8TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051K8TX.build.variant=STM32L0xx/L051K(6-8)T
GenL0.menu.pnum.GENERIC_L051K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L051K8Ux
GenL0.menu.pnum.GENERIC_L051K8UX=Generic L051K8Ux
GenL0.menu.pnum.GENERIC_L051K8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051K8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051K8UX.build.board=GENERIC_L051K8UX
GenL0.menu.pnum.GENERIC_L051K8UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051K8UX.build.variant=STM32L0xx/L051K(6-8)U
GenL0.menu.pnum.GENERIC_L051K8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x1.svd

# Generic L052C6Tx
GenL0.menu.pnum.GENERIC_L052C6TX=Generic L052C6Tx
GenL0.menu.pnum.GENERIC_L052C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C6TX.build.board=GENERIC_L052C6TX
GenL0.menu.pnum.GENERIC_L052C6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C6TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L052C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052C8Tx
GenL0.menu.pnum.GENERIC_L052C8TX=Generic L052C8Tx
GenL0.menu.pnum.GENERIC_L052C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C8TX.build.board=GENERIC_L052C8TX
GenL0.menu.pnum.GENERIC_L052C8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C8TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L052C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052C6Ux
GenL0.menu.pnum.GENERIC_L052C6UX=Generic L052C6Ux
GenL0.menu.pnum.GENERIC_L052C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C6UX.build.board=GENERIC_L052C6UX
GenL0.menu.pnum.GENERIC_L052C6UX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C6UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L052C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052C8Ux
GenL0.menu.pnum.GENERIC_L052C8UX=Generic L052C8Ux
GenL0.menu.pnum.GENERIC_L052C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052C8UX.build.board=GENERIC_L052C8UX
GenL0.menu.pnum.GENERIC_L052C8UX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052C8UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)
GenL0.menu.pnum.GENERIC_L052C8UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052K6Tx
GenL0.menu.pnum.GENERIC_L052K6TX=Generic L052K6Tx
GenL0.menu.pnum.GENERIC_L052K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052K6TX.build.board=GENERIC_L052K6TX
GenL0.menu.pnum.GENERIC_L052K6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052K6TX.build.variant=STM32L0xx/L052K(6-8)T_L062K8T
GenL0.menu.pnum.GENERIC_L052K6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052K8Tx
GenL0.menu.pnum.GENERIC_L052K8TX=Generic L052K8Tx
GenL0.menu.pnum.GENERIC_L052K8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052K8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052K8TX.build.board=GENERIC_L052K8TX
GenL0.menu.pnum.GENERIC_L052K8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052K8TX.build.variant=STM32L0xx/L052K(6-8)T_L062K8T
GenL0.menu.pnum.GENERIC_L052K8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052R6Hx
GenL0.menu.pnum.GENERIC_L052R6HX=Generic L052R6Hx
GenL0.menu.pnum.GENERIC_L052R6HX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052R6HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R6HX.build.board=GENERIC_L052R6HX
GenL0.menu.pnum.GENERIC_L052R6HX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R6HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H
GenL0.menu.pnum.GENERIC_L052R6HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052R8Hx
GenL0.menu.pnum.GENERIC_L052R8HX=Generic L052R8Hx
GenL0.menu.pnum.GENERIC_L052R8HX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052R8HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R8HX.build.board=GENERIC_L052R8HX
GenL0.menu.pnum.GENERIC_L052R8HX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R8HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H
GenL0.menu.pnum.GENERIC_L052R8HX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX=Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R6TX.build.board=GENERIC_L052R6TX
GenL0.menu.pnum.GENERIC_L052R6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R6TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T
GenL0.menu.pnum.GENERIC_L052R6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

# Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX=Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R8TX.build.board=GENERIC_L052R8TX
GenL0.menu.pnum.GENERIC_L052R8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T
GenL0.menu.pnum.GENERIC_L052R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L052.svd

