stm32duino/Arduino_Core_STM32/boards.txt
# Generic L083VBIx
GenL0.menu.pnum.GENERIC_L083VBIX=Generic L083VBIx
GenL0.menu.pnum.GENERIC_L083VBIX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083VBIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083VBIX.build.board=GENERIC_L083VBIX
GenL0.menu.pnum.GENERIC_L083VBIX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083VBIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083VBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083VZIx
GenL0.menu.pnum.GENERIC_L083VZIX=Generic L083VZIx
GenL0.menu.pnum.GENERIC_L083VZIX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083VZIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083VZIX.build.board=GENERIC_L083VZIX
GenL0.menu.pnum.GENERIC_L083VZIX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083VZIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083VZIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083VBTx
GenL0.menu.pnum.GENERIC_L083VBTX=Generic L083VBTx
GenL0.menu.pnum.GENERIC_L083VBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L083VBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083VBTX.build.board=GENERIC_L083VBTX
GenL0.menu.pnum.GENERIC_L083VBTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083VBTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083VBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083VZTx
GenL0.menu.pnum.GENERIC_L083VZTX=Generic L083VZTx
GenL0.menu.pnum.GENERIC_L083VZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L083VZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083VZTX.build.board=GENERIC_L083VZTX
GenL0.menu.pnum.GENERIC_L083VZTX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083VZTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083VZTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083V8Ix
GenL0.menu.pnum.GENERIC_L083V8IX=Generic L083V8Ix
GenL0.menu.pnum.GENERIC_L083V8IX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L083V8IX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083V8IX.build.board=GENERIC_L083V8IX
GenL0.menu.pnum.GENERIC_L083V8IX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083V8IX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083V8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Generic L083V8Tx
GenL0.menu.pnum.GENERIC_L083V8TX=Generic L083V8Tx
GenL0.menu.pnum.GENERIC_L083V8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L083V8TX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L083V8TX.build.board=GENERIC_L083V8TX
GenL0.menu.pnum.GENERIC_L083V8TX.build.product_line=STM32L083xx
GenL0.menu.pnum.GENERIC_L083V8TX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)
GenL0.menu.pnum.GENERIC_L083V8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L0xx/STM32L0x3.svd

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=swd
GenL0.menu.upload_method.swdMethod.upload.options=
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL0.menu.upload_method.jlinkMethod.upload.options=
GenL0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=serial
GenL0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenL0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic L1
GenL1.name=Generic STM32L1 series

GenL1.build.core=arduino
GenL1.build.board=GenL1
GenL1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL1.build.mcu=cortex-m3
GenL1.build.series=STM32L1xx
GenL1.build.flash_offset=0x0
GenL1.upload.maximum_size=0
GenL1.upload.maximum_data_size=0
GenL1.openocd.target=stm32l1
GenL1.vid.0=0x0483
GenL1.pid.0=0x5740

# Generic L100C6Ux
GenL1.menu.pnum.GENERIC_L100C6UX=Generic L100C6Ux
GenL1.menu.pnum.GENERIC_L100C6UX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L100C6UX.upload.maximum_data_size=4096
GenL1.menu.pnum.GENERIC_L100C6UX.build.board=GENERIC_L100C6UX
GenL1.menu.pnum.GENERIC_L100C6UX.build.product_line=STM32L100xB
GenL1.menu.pnum.GENERIC_L100C6UX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L100C6UX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L100.svd

# Generic L100C6UxA
GenL1.menu.pnum.GENERIC_L100C6UXA=Generic L100C6UxA
GenL1.menu.pnum.GENERIC_L100C6UXA.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L100C6UXA.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L100C6UXA.build.board=GENERIC_L100C6UXA
GenL1.menu.pnum.GENERIC_L100C6UXA.build.product_line=STM32L100xB
GenL1.menu.pnum.GENERIC_L100C6UXA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L100C6UXA.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L100.svd

# Generic L151C6Tx
GenL1.menu.pnum.GENERIC_L151C6TX=Generic L151C6Tx
GenL1.menu.pnum.GENERIC_L151C6TX.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C6TX.build.board=GENERIC_L151C6TX
GenL1.menu.pnum.GENERIC_L151C6TX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C6TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151C8Tx
GenL1.menu.pnum.GENERIC_L151C8TX=Generic L151C8Tx
GenL1.menu.pnum.GENERIC_L151C8TX.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8TX.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C8TX.build.board=GENERIC_L151C8TX
GenL1.menu.pnum.GENERIC_L151C8TX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C8TX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151C8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

# Generic L151CBTx
GenL1.menu.pnum.GENERIC_L151CBTX=Generic L151CBTx
GenL1.menu.pnum.GENERIC_L151CBTX.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CBTX.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151CBTX.build.board=GENERIC_L151CBTX
GenL1.menu.pnum.GENERIC_L151CBTX.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151CBTX.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
GenL1.menu.pnum.GENERIC_L151CBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L1xx/STM32L151.svd

