stm32duino/Arduino_Core_STM32/boards.txt
# Generic L433RCIx
GenL4.menu.pnum.GENERIC_L433RCIX=Generic L433RCIx
GenL4.menu.pnum.GENERIC_L433RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCIX.build.board=GENERIC_L433RCIX
GenL4.menu.pnum.GENERIC_L433RCIX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCIX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L433RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L433RBTx
GenL4.menu.pnum.GENERIC_L433RBTX=Generic L433RBTx
GenL4.menu.pnum.GENERIC_L433RBTX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433RBTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RBTX.build.board=GENERIC_L433RBTX
GenL4.menu.pnum.GENERIC_L433RBTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RBTX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L433RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L433RCTx
GenL4.menu.pnum.GENERIC_L433RCTX=Generic L433RCTx
GenL4.menu.pnum.GENERIC_L433RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCTX.build.board=GENERIC_L433RCTX
GenL4.menu.pnum.GENERIC_L433RCTX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCTX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L433RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L433RBYx
GenL4.menu.pnum.GENERIC_L433RBYX=Generic L433RBYx
GenL4.menu.pnum.GENERIC_L433RBYX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433RBYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RBYX.build.board=GENERIC_L433RBYX
GenL4.menu.pnum.GENERIC_L433RBYX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RBYX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L433RBYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L433RCYx
GenL4.menu.pnum.GENERIC_L433RCYX=Generic L433RCYx
GenL4.menu.pnum.GENERIC_L433RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCYX.build.board=GENERIC_L433RCYX
GenL4.menu.pnum.GENERIC_L433RCYX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCYX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L433RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L443RCIx
GenL4.menu.pnum.GENERIC_L443RCIX=Generic L443RCIx
GenL4.menu.pnum.GENERIC_L443RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443RCIX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443RCIX.build.board=GENERIC_L443RCIX
GenL4.menu.pnum.GENERIC_L443RCIX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443RCIX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L443RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L443RCTx
GenL4.menu.pnum.GENERIC_L443RCTX=Generic L443RCTx
GenL4.menu.pnum.GENERIC_L443RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443RCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443RCTX.build.board=GENERIC_L443RCTX
GenL4.menu.pnum.GENERIC_L443RCTX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443RCTX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L443RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L443RCYx
GenL4.menu.pnum.GENERIC_L443RCYX=Generic L443RCYx
GenL4.menu.pnum.GENERIC_L443RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443RCYX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443RCYX.build.board=GENERIC_L443RCYX
GenL4.menu.pnum.GENERIC_L443RCYX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443RCYX.build.variant=STM32L4xx/L433R(B-C)(I-T-Y)_L443RC(I-T-Y)
GenL4.menu.pnum.GENERIC_L443RCYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP=Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCTXP.build.board=GENERIC_L433RCTXP
GenL4.menu.pnum.GENERIC_L433RCTXP.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCTXP.build.variant=STM32L4xx/L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX=Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCTX.build.board=GENERIC_L443CCTX
GenL4.menu.pnum.GENERIC_L443CCTX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)
GenL4.menu.pnum.GENERIC_L443CCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX=Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCUX.build.board=GENERIC_L443CCUX
GenL4.menu.pnum.GENERIC_L443CCUX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)
GenL4.menu.pnum.GENERIC_L443CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX=Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCIX.build.board=GENERIC_L452RCIX
GenL4.menu.pnum.GENERIC_L452RCIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x2.svd

# Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX=Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452REIX.build.board=GENERIC_L452REIX
GenL4.menu.pnum.GENERIC_L452REIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452REIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x2.svd

# Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX=Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCTX.build.board=GENERIC_L452RCTX
GenL4.menu.pnum.GENERIC_L452RCTX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCTX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x2.svd

# Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX=Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETX.build.board=GENERIC_L452RETX
GenL4.menu.pnum.GENERIC_L452RETX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)
GenL4.menu.pnum.GENERIC_L452RETX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x2.svd

