stm32duino/Arduino_Core_STM32/boards.txt
# Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX=Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.board=GENERIC_L4R5VGTX
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
GenL4.menu.pnum.GENERIC_L4R5VGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX=Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VITX.build.board=GENERIC_L4R5VITX
GenL4.menu.pnum.GENERIC_L4R5VITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
GenL4.menu.pnum.GENERIC_L4R5VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX=Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.board=GENERIC_L4R5ZGTX
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT
GenL4.menu.pnum.GENERIC_L4R5ZGTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX=Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.board=GENERIC_L4R5ZGYX
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4R5ZGYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX=Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.board=GENERIC_L4R5ZITX
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT
GenL4.menu.pnum.GENERIC_L4R5ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX=Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.board=GENERIC_L4R5ZIYX
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4R5ZIYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP=Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.board=GENERIC_L4R5ZITXP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.variant=STM32L4xx/L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX=Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7VITX.build.board=GENERIC_L4R7VITX
GenL4.menu.pnum.GENERIC_L4R7VITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
GenL4.menu.pnum.GENERIC_L4R7VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R7.svd

# Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX=Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.board=GENERIC_L4R7ZITX
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT
GenL4.menu.pnum.GENERIC_L4R7ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R7.svd

# Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX=Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.board=GENERIC_L4R9ZGJX
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZGJX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R9.svd

# Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX=Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.board=GENERIC_L4R9ZGYX
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4R9ZGYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R9.svd

# Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX=Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.board=GENERIC_L4R9ZIJX
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZIJX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R9.svd

# Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX=Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.board=GENERIC_L4R9ZIYX
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4R9ZIYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R9.svd

# Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX=Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5VITX.build.board=GENERIC_L4S5VITX
GenL4.menu.pnum.GENERIC_L4S5VITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
GenL4.menu.pnum.GENERIC_L4S5VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S5.svd

# Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX=Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.board=GENERIC_L4S5ZITX
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT
GenL4.menu.pnum.GENERIC_L4S5ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S5.svd

# Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX=Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.board=GENERIC_L4S5ZIYX
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4S5ZIYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S5.svd

# Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX=Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7VITX.build.board=GENERIC_L4S7VITX
GenL4.menu.pnum.GENERIC_L4S7VITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT
GenL4.menu.pnum.GENERIC_L4S7VITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S7.svd

# Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX=Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.board=GENERIC_L4S7ZITX
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT
GenL4.menu.pnum.GENERIC_L4S7ZITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S7.svd

# Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX=Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.board=GENERIC_L4S9ZIJX
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ
GenL4.menu.pnum.GENERIC_L4S9ZIJX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S9.svd

# Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX=Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.board=GENERIC_L4S9ZIYX
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
GenL4.menu.pnum.GENERIC_L4S9ZIYX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4S9.svd

# Upload menu
GenL4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL4.menu.upload_method.swdMethod.upload.protocol=swd
GenL4.menu.upload_method.swdMethod.upload.options=
GenL4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

