stm32duino/Arduino_Core_STM32/boards.txt
GenL4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL4.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL4.menu.upload_method.jlinkMethod.upload.options=
GenL4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=serial
GenL4.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL4.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL4.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL4.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL4.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL4.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL4.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic L5
GenL5.name=Generic STM32L5 series

GenL5.build.core=arduino
GenL5.build.board=GenL5
GenL5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL5.build.mcu=cortex-m33
GenL5.build.fpu=-mfpu=fpv4-sp-d16
GenL5.build.float-abi=-mfloat-abi=hard
GenL5.build.series=STM32L5xx
GenL5.build.flash_offset=0x0
GenL5.upload.maximum_size=0
GenL5.upload.maximum_data_size=0
GenL5.openocd.target=stm32l5x
GenL5.vid.0=0x0483
GenL5.pid.0=0x5740

# Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ=Generic L552ZCTxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_size=262144
GenL5.menu.pnum.GENERIC_L552ZCTXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.board=GENERIC_L552ZCTXQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZCTXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L552ZCTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ=Generic L552ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L552ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.board=GENERIC_L552ZETXQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L552ZETXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L552.svd

# Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ=Generic L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L562ZETXQ.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.board=GENERIC_L562ZETXQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.product_line=STM32L562xx
GenL5.menu.pnum.GENERIC_L562ZETXQ.build.variant=STM32L5xx/L552Z(C-E)TxQ_L562ZETxQ
GenL5.menu.pnum.GENERIC_L562ZETXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L5xx/STM32L562.svd

# Upload menu
GenL5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL5.menu.upload_method.swdMethod.upload.protocol=swd
GenL5.menu.upload_method.swdMethod.upload.options=
GenL5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenL5.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenL5.menu.upload_method.jlinkMethod.upload.options=
GenL5.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL5.menu.upload_method.serialMethod.upload.protocol=serial
GenL5.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenL5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL5.menu.upload_method.dfuMethod.upload.protocol=dfu
GenL5.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenL5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenL5.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenL5.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenL5.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenL5.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenL5.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

###############################
# Generic U0
GenU0.name=Generic STM32U0 series

GenU0.build.core=arduino
GenU0.build.board=GenG0
GenU0.build.mcu=cortex-m0plus
GenU0.build.series=STM32U0xx
GenU0.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenU0.build.flash_offset=0x0
GenU0.upload.maximum_size=0
GenU0.upload.maximum_data_size=0
# Current openocd version does not support U0
# GenU0.openocd.target=stm32u0x
GenU0.vid.0=0x0483
GenU0.pid.0=0x5740

# Generic U073R8Ix
GenU0.menu.pnum.GENERIC_U073R8IX=Generic U073R8Ix
GenU0.menu.pnum.GENERIC_U073R8IX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073R8IX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073R8IX.build.board=GENERIC_U073R8IX
GenU0.menu.pnum.GENERIC_U073R8IX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073R8IX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073R8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073R8Tx
GenU0.menu.pnum.GENERIC_U073R8TX=Generic U073R8Tx
GenU0.menu.pnum.GENERIC_U073R8TX.upload.maximum_size=65536
GenU0.menu.pnum.GENERIC_U073R8TX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073R8TX.build.board=GENERIC_U073R8TX
GenU0.menu.pnum.GENERIC_U073R8TX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073R8TX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073R8TX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RBIx
GenU0.menu.pnum.GENERIC_U073RBIX=Generic U073RBIx
GenU0.menu.pnum.GENERIC_U073RBIX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073RBIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RBIX.build.board=GENERIC_U073RBIX
GenU0.menu.pnum.GENERIC_U073RBIX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RBIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RBTx
GenU0.menu.pnum.GENERIC_U073RBTX=Generic U073RBTx
GenU0.menu.pnum.GENERIC_U073RBTX.upload.maximum_size=131072
GenU0.menu.pnum.GENERIC_U073RBTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RBTX.build.board=GENERIC_U073RBTX
GenU0.menu.pnum.GENERIC_U073RBTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RBTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RBTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RCIx
GenU0.menu.pnum.GENERIC_U073RCIX=Generic U073RCIx
GenU0.menu.pnum.GENERIC_U073RCIX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073RCIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RCIX.build.board=GENERIC_U073RCIX
GenU0.menu.pnum.GENERIC_U073RCIX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RCIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

# Generic U073RCTx
GenU0.menu.pnum.GENERIC_U073RCTX=Generic U073RCTx
GenU0.menu.pnum.GENERIC_U073RCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U073RCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U073RCTX.build.board=GENERIC_U073RCTX
GenU0.menu.pnum.GENERIC_U073RCTX.build.product_line=STM32U073xx
GenU0.menu.pnum.GENERIC_U073RCTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U073RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U073.svd

