stm32duino/Arduino_Core_STM32/boards.txt
# Generic U083RCIx
GenU0.menu.pnum.GENERIC_U083RCIX=Generic U083RCIx
GenU0.menu.pnum.GENERIC_U083RCIX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083RCIX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083RCIX.build.board=GENERIC_U083RCIX
GenU0.menu.pnum.GENERIC_U083RCIX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083RCIX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U083RCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

# Generic U083RCTx
GenU0.menu.pnum.GENERIC_U083RCTX=Generic U083RCTx
GenU0.menu.pnum.GENERIC_U083RCTX.upload.maximum_size=262144
GenU0.menu.pnum.GENERIC_U083RCTX.upload.maximum_data_size=40960
GenU0.menu.pnum.GENERIC_U083RCTX.build.board=GENERIC_U083RCTX
GenU0.menu.pnum.GENERIC_U083RCTX.build.product_line=STM32U083xx
GenU0.menu.pnum.GENERIC_U083RCTX.build.variant=STM32U0xx/U073R(8-B-C)(I-T)_U083RC(I-T)
GenU0.menu.pnum.GENERIC_U083RCTX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U0xx/STM32U083.svd

# Upload menu
GenU0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU0.menu.upload_method.swdMethod.upload.protocol=swd
GenU0.menu.upload_method.swdMethod.upload.options=
GenU0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenU0.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenU0.menu.upload_method.jlinkMethod.upload.options=
GenU0.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU0.menu.upload_method.serialMethod.upload.protocol=serial
GenU0.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenU0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU0.menu.upload_method.dfuMethod.upload.protocol=dfu
GenU0.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenU0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

#GenU0.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
#GenU0.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
#GenU0.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

#GenU0.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
#GenU0.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
#GenU0.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic U5
GenU5.name=Generic STM32U5 series

GenU5.build.core=arduino
GenU5.build.board=GenU5
GenU5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenU5.build.mcu=cortex-m33
GenU5.build.fpu=-mfpu=fpv4-sp-d16
GenU5.build.float-abi=-mfloat-abi=hard
GenU5.build.series=STM32U5xx
GenU5.build.flash_offset=0x0
GenU5.upload.maximum_size=0
GenU5.upload.maximum_data_size=0
GenU5.openocd.target=stm32u5x
GenU5.vid.0=0x0483
GenU5.pid.0=0x5740

# Generic U575AGIxQ
GenU5.menu.pnum.GENERIC_U575AGIXQ=Generic U575AGIxQ
GenU5.menu.pnum.GENERIC_U575AGIXQ.upload.maximum_size=1048576
GenU5.menu.pnum.GENERIC_U575AGIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.board=GENERIC_U575AGIXQ
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575AGIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
GenU5.menu.pnum.GENERIC_U575AGIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U575AIIxQ
GenU5.menu.pnum.GENERIC_U575AIIXQ=Generic U575AIIxQ
GenU5.menu.pnum.GENERIC_U575AIIXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575AIIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.board=GENERIC_U575AIIXQ
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575AIIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
GenU5.menu.pnum.GENERIC_U575AIIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U575CITx
GenU5.menu.pnum.GENERIC_U575CITX=Generic U575CITx
GenU5.menu.pnum.GENERIC_U575CITX.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575CITX.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U575CITX.build.board=GENERIC_U575CITX
GenU5.menu.pnum.GENERIC_U575CITX.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575CITX.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
GenU5.menu.pnum.GENERIC_U575CITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U575CIUx
GenU5.menu.pnum.GENERIC_U575CIUX=Generic U575CIUx
GenU5.menu.pnum.GENERIC_U575CIUX.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575CIUX.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U575CIUX.build.board=GENERIC_U575CIUX
GenU5.menu.pnum.GENERIC_U575CIUX.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575CIUX.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
GenU5.menu.pnum.GENERIC_U575CIUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U575ZGTxQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ=Generic U575ZGTxQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ.upload.maximum_size=1048576
GenU5.menu.pnum.GENERIC_U575ZGTXQ.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.board=GENERIC_U575ZGTXQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575ZGTXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ
GenU5.menu.pnum.GENERIC_U575ZGTXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U575ZITxQ
GenU5.menu.pnum.GENERIC_U575ZITXQ=Generic U575ZITxQ
GenU5.menu.pnum.GENERIC_U575ZITXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U575ZITXQ.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.board=GENERIC_U575ZITXQ
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.product_line=STM32U575xx
GenU5.menu.pnum.GENERIC_U575ZITXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ
GenU5.menu.pnum.GENERIC_U575ZITXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U575.svd

# Generic U585AIIxQ
GenU5.menu.pnum.GENERIC_U585AIIXQ=Generic U585AIIxQ
GenU5.menu.pnum.GENERIC_U585AIIXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585AIIXQ.upload.maximum_data_size=262144
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.board=GENERIC_U585AIIXQ
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585AIIXQ.build.variant=STM32U5xx/U575A(G-I)IxQ_U585AIIxQ
GenU5.menu.pnum.GENERIC_U585AIIXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Generic U585CITx
GenU5.menu.pnum.GENERIC_U585CITX=Generic U585CITx
GenU5.menu.pnum.GENERIC_U585CITX.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585CITX.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U585CITX.build.board=GENERIC_U585CITX
GenU5.menu.pnum.GENERIC_U585CITX.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585CITX.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
GenU5.menu.pnum.GENERIC_U585CITX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Generic U585CIUx
GenU5.menu.pnum.GENERIC_U585CIUX=Generic U585CIUx
GenU5.menu.pnum.GENERIC_U585CIUX.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585CIUX.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U585CIUX.build.board=GENERIC_U585CIUX
GenU5.menu.pnum.GENERIC_U585CIUX.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585CIUX.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
GenU5.menu.pnum.GENERIC_U585CIUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Generic U585ZITxQ
GenU5.menu.pnum.GENERIC_U585ZITXQ=Generic U585ZITxQ
GenU5.menu.pnum.GENERIC_U585ZITXQ.upload.maximum_size=2097152
GenU5.menu.pnum.GENERIC_U585ZITXQ.upload.maximum_data_size=786432
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.board=GENERIC_U585ZITXQ
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.product_line=STM32U585xx
GenU5.menu.pnum.GENERIC_U585ZITXQ.build.variant=STM32U5xx/U575Z(G-I)TxQ_U585ZITxQ
GenU5.menu.pnum.GENERIC_U585ZITXQ.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32U5xx/STM32U585.svd

# Upload menu
GenU5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenU5.menu.upload_method.swdMethod.upload.protocol=swd
GenU5.menu.upload_method.swdMethod.upload.options=
GenU5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenU5.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenU5.menu.upload_method.jlinkMethod.upload.options=
GenU5.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenU5.menu.upload_method.serialMethod.upload.protocol=serial
GenU5.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenU5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenU5.menu.upload_method.dfuMethod.upload.protocol=dfu
GenU5.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenU5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenU5.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenU5.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenU5.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenU5.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenU5.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenU5.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WB
GenWB.name=Generic STM32WB series

GenWB.build.core=arduino
GenWB.build.board=GenWB
GenWB.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenWB.build.mcu=cortex-m4
GenWB.build.fpu=-mfpu=fpv4-sp-d16
GenWB.build.float-abi=-mfloat-abi=hard
GenWB.build.series=STM32WBxx
GenWB.build.flash_offset=0x0
GenWB.upload.maximum_size=0
GenWB.upload.maximum_data_size=0
GenWB.openocd.target=stm32wbx
GenWB.vid.0=0x0483
GenWB.pid.0=0x5740

