stm32duino/Arduino_Core_STM32/boards.txt
# Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX=Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_data_size=12288
GenWB.menu.pnum.GENERIC_WB15CCUX.build.board=GENERIC_WB15CCUX
GenWB.menu.pnum.GENERIC_WB15CCUX.build.product_line=STM32WB15xx
GenWB.menu.pnum.GENERIC_WB15CCUX.build.variant=STM32WBxx/WB15CCU
GenWB.menu.pnum.GENERIC_WB15CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB15_CM4.svd

# Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX=Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55CCUX.build.board=GENERIC_WB55CCUX
GenWB.menu.pnum.GENERIC_WB55CCUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CCUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX=Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CEUX.build.board=GENERIC_WB55CEUX
GenWB.menu.pnum.GENERIC_WB55CEUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CEUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX=Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CGUX.build.board=GENERIC_WB55CGUX
GenWB.menu.pnum.GENERIC_WB55CGUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CGUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U
GenWB.menu.pnum.GENERIC_WB55CGUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX=Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_size=827392
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.board=GENERIC_WB5MMGHX
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.product_line=STM32WB5Mxx
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.variant=STM32WBxx/WB5MMGH
GenWB.menu.pnum.GENERIC_WB5MMGHX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX=Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55RCVX.build.board=GENERIC_WB55RCVX
GenWB.menu.pnum.GENERIC_WB55RCVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RCVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55RCVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX=Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55REVX.build.board=GENERIC_WB55REVX
GenWB.menu.pnum.GENERIC_WB55REVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55REVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55REVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX=Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RGVX.build.board=GENERIC_WB55RGVX
GenWB.menu.pnum.GENERIC_WB55RGVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RGVX.build.variant=STM32WBxx/WB55R(C-E-G)V
GenWB.menu.pnum.GENERIC_WB55RGVX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Upload menu
GenWB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB.menu.upload_method.swdMethod.upload.protocol=swd
GenWB.menu.upload_method.swdMethod.upload.options=
GenWB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWB.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWB.menu.upload_method.jlinkMethod.upload.options=
GenWB.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB.menu.upload_method.serialMethod.upload.protocol=serial
GenWB.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWB.menu.upload_method.dfuMethod.upload.protocol=dfu
GenWB.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenWB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWB.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWB.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWB.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWB.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWB.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WBA
GenWBA.name=Generic STM32WBA series

GenWBA.build.core=arduino
GenWBA.build.board=GenWBA
GenWBA.build.st_extra_flags=-D{build.product_line} {build.xSerial}
GenWBA.build.mcu=cortex-m33
GenWBA.build.fpu=-mfpu=fpv4-sp-d16
GenWBA.build.float-abi=-mfloat-abi=hard
GenWBA.build.series=STM32WBAxx
GenWBA.build.flash_offset=0x0
GenWBA.upload.maximum_size=0
GenWBA.upload.maximum_data_size=0
GenWBA.openocd.target=stm32wbax

# Generic WBA55CEUx
GenWBA.menu.pnum.GENERIC_WBA55CEUX=Generic WBA55CEUx
GenWBA.menu.pnum.GENERIC_WBA55CEUX.upload.maximum_size=524288
GenWBA.menu.pnum.GENERIC_WBA55CEUX.upload.maximum_data_size=98304
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.board=GENERIC_WBA55CEUX
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.product_line=STM32WBA55xx
GenWBA.menu.pnum.GENERIC_WBA55CEUX.build.variant=STM32WBAxx/WBA55C(E-G)U
GenWBA.menu.pnum.GENERIC_WBA55CEUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# Generic WBA55CGUx
GenWBA.menu.pnum.GENERIC_WBA55CGUX=Generic WBA55CGUx
GenWBA.menu.pnum.GENERIC_WBA55CGUX.upload.maximum_size=1048576
GenWBA.menu.pnum.GENERIC_WBA55CGUX.upload.maximum_data_size=131072
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.board=GENERIC_WBA55CGUX
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.product_line=STM32WBA55xx
GenWBA.menu.pnum.GENERIC_WBA55CGUX.build.variant=STM32WBAxx/WBA55C(E-G)U
GenWBA.menu.pnum.GENERIC_WBA55CGUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBAxx/STM32WBA55.svd

# Upload menu
GenWBA.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWBA.menu.upload_method.swdMethod.upload.protocol=swd
GenWBA.menu.upload_method.swdMethod.upload.options=
GenWBA.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWBA.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWBA.menu.upload_method.jlinkMethod.upload.options=
GenWBA.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWBA.menu.upload_method.serialMethod.upload.protocol=serial
GenWBA.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWBA.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWBA.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWBA.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWBA.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWBA.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWBA.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWBA.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Generic WL
GenWL.name=Generic STM32WL series

GenWL.build.core=arduino
GenWL.build.board=GenWL
GenWL.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
GenWL.build.mcu=cortex-m4
#GenWL.build.fpu=-mfpu=fpv4-sp-d16
#GenWL.build.float-abi=-mfloat-abi=hard
GenWL.build.series=STM32WLxx
GenWL.build.flash_offset=0x0
GenWL.upload.maximum_size=0
GenWL.upload.maximum_data_size=0
GenWL.openocd.target=stm32wlx

# Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX=Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL54CCUX.build.board=GENERIC_WL54CCUX
GenWL.menu.pnum.GENERIC_WL54CCUX.build.product_line=STM32WL54xx
GenWL.menu.pnum.GENERIC_WL54CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
GenWL.menu.pnum.GENERIC_WL54CCUX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WL5x_CM4.svd

