stm32duino/Arduino_Core_STM32/boards.txt
# Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX=Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.board=GENERIC_WLE5J8IX
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE5J8IX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX=Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.board=GENERIC_WLE5JBIX
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE5JBIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX=Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.board=GENERIC_WLE5JCIX
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
GenWL.menu.pnum.GENERIC_WLE5JCIX.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Upload menu
GenWL.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWL.menu.upload_method.swdMethod.upload.protocol=swd
GenWL.menu.upload_method.swdMethod.upload.options=
GenWL.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenWL.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenWL.menu.upload_method.jlinkMethod.upload.options=
GenWL.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWL.menu.upload_method.serialMethod.upload.protocol=serial
GenWL.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenWL.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWL.menu.upload_method.dfuMethod.upload.protocol=dfu
GenWL.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenWL.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenWL.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenWL.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenWL.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenWL.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenWL.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# 3D printer boards

3dprinter.name=3D printer boards

3dprinter.build.core=arduino
3dprinter.build.board=3dprinter
3dprinter.build.variant_h=variant_{build.board}.h
3dprinter.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
3dprinter.build.flash_offset=0x0
3dprinter.upload.maximum_size=0
3dprinter.upload.maximum_data_size=0
3dprinter.vid.0=0x0483
3dprinter.pid.0=0x5740

# ARMED_V1 board
3dprinter.menu.pnum.ARMED_V1=Armed V1
3dprinter.menu.pnum.ARMED_V1.upload.maximum_size=524288
3dprinter.menu.pnum.ARMED_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.ARMED_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.ARMED_V1.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.ARMED_V1.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.ARMED_V1.build.board=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.series=STM32F4xx
3dprinter.menu.pnum.ARMED_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.ARMED_V1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.ARMED_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.ARMED_V1.openocd.target=stm32f4x
3dprinter.menu.pnum.ARMED_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# Big Tree Tech EBB42_V1_1 board
3dprinter.menu.pnum.EBB42_V1_1=Big Tree Tech EBB42 V1.1
3dprinter.menu.pnum.EBB42_V1_1.upload.maximum_size=131072
3dprinter.menu.pnum.EBB42_V1_1.upload.maximum_data_size=147456
3dprinter.menu.pnum.EBB42_V1_1.build.mcu=cortex-m0plus
3dprinter.menu.pnum.EBB42_V1_1.build.board=EBB42_V1_1
3dprinter.menu.pnum.EBB42_V1_1.build.series=STM32G0xx
3dprinter.menu.pnum.EBB42_V1_1.build.product_line=STM32G0B1xx
3dprinter.menu.pnum.EBB42_V1_1.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
3dprinter.menu.pnum.EBB42_V1_1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
3dprinter.menu.pnum.EBB42_V1_1.openocd.target=stm32g0x
3dprinter.menu.pnum.EBB42_V1_1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32G0xx/STM32G0B1.svd

# REMRAM_V1 board
3dprinter.menu.pnum.REMRAM_V1=RemRam v1
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_size=2097152
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_data_size=524288
3dprinter.menu.pnum.REMRAM_V1.build.mcu=cortex-m7
3dprinter.menu.pnum.REMRAM_V1.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.REMRAM_V1.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.REMRAM_V1.build.board=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.series=STM32F7xx
3dprinter.menu.pnum.REMRAM_V1.build.product_line=STM32F765xx
3dprinter.menu.pnum.REMRAM_V1.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
3dprinter.menu.pnum.REMRAM_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.REMRAM_V1.openocd.target=stm32f7x
3dprinter.menu.pnum.REMRAM_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F765.svd

# RUMBA32 board
3dprinter.menu.pnum.RUMBA32=RUMBA32
3dprinter.menu.pnum.RUMBA32.upload.maximum_size=524288
3dprinter.menu.pnum.RUMBA32.upload.maximum_data_size=131072
3dprinter.menu.pnum.RUMBA32.build.mcu=cortex-m4
3dprinter.menu.pnum.RUMBA32.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.RUMBA32.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.RUMBA32.build.board=RUMBA32
3dprinter.menu.pnum.RUMBA32.build.series=STM32F4xx
3dprinter.menu.pnum.RUMBA32.build.product_line=STM32F446xx
3dprinter.menu.pnum.RUMBA32.build.variant=STM32F4xx/F446V(C-E)T
3dprinter.menu.pnum.RUMBA32.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.RUMBA32.openocd.target=stm32f4x
3dprinter.menu.pnum.RUMBA32.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F446.svd

# STEVAL-3DP001V1 board
3dprinter.menu.pnum.ST3DP001_EVAL=STEVAL-3DP001V1
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_size=524288
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_data_size=98304
3dprinter.menu.pnum.ST3DP001_EVAL.build.mcu=cortex-m4
3dprinter.menu.pnum.ST3DP001_EVAL.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.ST3DP001_EVAL.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.ST3DP001_EVAL.build.board=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.series=STM32F4xx
3dprinter.menu.pnum.ST3DP001_EVAL.build.product_line=STM32F401xE
3dprinter.menu.pnum.ST3DP001_EVAL.build.variant=STM32F4xx/F401V(B-C-D-E)T
3dprinter.menu.pnum.ST3DP001_EVAL.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.ST3DP001_EVAL.openocd.target=stm32f4x
3dprinter.menu.pnum.ST3DP001_EVAL.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# PRNTR_V1 board
3dprinter.menu.pnum.PRNTR_V1=PRNTR v1
3dprinter.menu.pnum.PRNTR_V1.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.PRNTR_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.PRNTR_V1.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.PRNTR_V1.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_V1.build.board=PRNTR_V1
3dprinter.menu.pnum.PRNTR_V1.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_V1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.PRNTR_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.PRNTR_V1.openocd.target=stm32f4x
3dprinter.menu.pnum.PRNTR_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# PRNTR_V2 board
3dprinter.menu.pnum.PRNTR_V2=PRNTR v2
3dprinter.menu.pnum.PRNTR_V2.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_V2.upload.maximum_data_size=131072
3dprinter.menu.pnum.PRNTR_V2.build.mcu=cortex-m4
3dprinter.menu.pnum.PRNTR_V2.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.PRNTR_V2.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_V2.build.board=PRNTR_V2
3dprinter.menu.pnum.PRNTR_V2.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_V2.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_V2.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.PRNTR_V2.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.PRNTR_V2.build.flash_offset=0x8000
3dprinter.menu.pnum.PRNTR_V2.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
3dprinter.menu.pnum.PRNTR_V2.openocd.target=stm32f4x
3dprinter.menu.pnum.PRNTR_V2.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F407.svd

# EEXTR_F030_V1 board
3dprinter.menu.pnum.EEXTR_F030_V1=EExtruder F030 V1
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_size=65536
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_data_size=8192
3dprinter.menu.pnum.EEXTR_F030_V1.build.mcu=cortex-m0
3dprinter.menu.pnum.EEXTR_F030_V1.build.board=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.series=STM32F0xx
3dprinter.menu.pnum.EEXTR_F030_V1.build.product_line=STM32F030x8
3dprinter.menu.pnum.EEXTR_F030_V1.build.variant=STM32F0xx/F030C8T
3dprinter.menu.pnum.EEXTR_F030_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.EEXTR_F030_V1.openocd.target=stm32f0x
3dprinter.menu.pnum.EEXTR_F030_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x0.svd

