stm32duino/Arduino_Core_STM32/boards.txt
3dprinter.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
3dprinter.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
3dprinter.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Blues boards

Blues.name=Blues boards

Blues.build.core=arduino
Blues.build.board=Blues
Blues.build.variant_h=variant_{build.board}.h
Blues.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Blues.build.flash_offset=0x0
Blues.upload.maximum_size=0
Blues.upload.maximum_data_size=0

# Swan R5 board
Blues.menu.pnum.SWAN_R5=Swan R5
Blues.menu.pnum.SWAN_R5.upload.maximum_size=2097152
Blues.menu.pnum.SWAN_R5.upload.maximum_data_size=655360
Blues.menu.pnum.SWAN_R5.build.mcu=cortex-m4
Blues.menu.pnum.SWAN_R5.build.fpu=-mfpu=fpv4-sp-d16
Blues.menu.pnum.SWAN_R5.build.float-abi=-mfloat-abi=hard
Blues.menu.pnum.SWAN_R5.build.board=SWAN_R5
Blues.menu.pnum.SWAN_R5.build.series=STM32L4xx
Blues.menu.pnum.SWAN_R5.build.product_line=STM32L4R5xx
Blues.menu.pnum.SWAN_R5.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
Blues.menu.pnum.SWAN_R5.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Blues.menu.pnum.SWAN_R5.vid.0=0x30A4
Blues.menu.pnum.SWAN_R5.pid.0=0x0002
Blues.menu.pnum.SWAN_R5.openocd.target=stm32l4x
Blues.menu.pnum.SWAN_R5.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4R5.svd

# Cygnet board
Blues.menu.pnum.CYGNET=Cygnet
Blues.menu.pnum.CYGNET.upload.maximum_size=262144
Blues.menu.pnum.CYGNET.upload.maximum_data_size=65536
Blues.menu.pnum.CYGNET.build.mcu=cortex-m4
Blues.menu.pnum.CYGNET.build.fpu=-mfpu=fpv4-sp-d16
Blues.menu.pnum.CYGNET.build.float-abi=-mfloat-abi=hard
Blues.menu.pnum.CYGNET.build.board=CYGNET
Blues.menu.pnum.CYGNET.build.series=STM32L4xx
Blues.menu.pnum.CYGNET.build.product_line=STM32L433xx
Blues.menu.pnum.CYGNET.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)
Blues.menu.pnum.CYGNET.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Blues.menu.pnum.CYGNET.vid.0=0x30A4
Blues.menu.pnum.CYGNET.pid.0=0x0003
Blues.menu.pnum.CYGNET.openocd.target=stm32l4x
Blues.menu.pnum.CYGNET.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32L4xx/STM32L4x3.svd

# Upload menu
Blues.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Blues.menu.upload_method.swdMethod.upload.protocol=swd
Blues.menu.upload_method.swdMethod.upload.options=
Blues.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Blues.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Blues.menu.upload_method.jlinkMethod.upload.protocol=jlink
Blues.menu.upload_method.jlinkMethod.upload.options=
Blues.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Blues.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Blues.menu.upload_method.serialMethod.upload.protocol=serial
Blues.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
Blues.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Blues.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Blues.menu.upload_method.dfuMethod.upload.protocol=dfu
Blues.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Blues.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Blues.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Blues.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Blues.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

Blues.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Blues.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Blues.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Elecgator boards

Elecgator.name=Elecgator boards

Elecgator.build.core=arduino
Elecgator.build.board=elecgator
Elecgator.build.variant_h=variant_{build.board}.h
Elecgator.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Elecgator.build.flash_offset=0x0
Elecgator.upload.maximum_size=0
Elecgator.upload.maximum_data_size=0
Elecgator.vid.0=0x0483
Elecgator.pid.0=0x5740

# EtherCATduino board
Elecgator.menu.pnum.ETHERCAT_DUINO=EtherCATduino
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_size=524288
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_data_size=327680
Elecgator.menu.pnum.ETHERCAT_DUINO.build.mcu=cortex-m7
Elecgator.menu.pnum.ETHERCAT_DUINO.build.fpu=-mfpu=fpv4-sp-d16
Elecgator.menu.pnum.ETHERCAT_DUINO.build.float-abi=-mfloat-abi=hard
Elecgator.menu.pnum.ETHERCAT_DUINO.build.board=ETHERCAT_DUINO
Elecgator.menu.pnum.ETHERCAT_DUINO.build.series=STM32F7xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.product_line=STM32F746xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)
Elecgator.menu.pnum.ETHERCAT_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Elecgator.menu.pnum.ETHERCAT_DUINO.openocd.target=stm32f7x
Elecgator.menu.pnum.ETHERCAT_DUINO.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F7xx/STM32F746.svd

# Upload menu
Elecgator.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Elecgator.menu.upload_method.swdMethod.upload.protocol=swd
Elecgator.menu.upload_method.swdMethod.upload.options=
Elecgator.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Elecgator.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Elecgator.menu.upload_method.jlinkMethod.upload.protocol=jlink
Elecgator.menu.upload_method.jlinkMethod.upload.options=
Elecgator.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Elecgator.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Elecgator.menu.upload_method.dfuMethod.upload.protocol=dfu
Elecgator.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Elecgator.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Elecgator.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
Elecgator.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
Elecgator.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

