stm32duino/Arduino_Core_STM32/boards.txt
Elecgator.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
Elecgator.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
Elecgator.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.variant_h=variant_{build.board}.h
ESC_board.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
ESC_board.build.flash_offset=0x0
ESC_board.upload.maximum_size=0
ESC_board.upload.maximum_data_size=0
ESC_board.vid.0=0x0483
ESC_board.pid.0=0x5740

# WRAITH32_V1 board
ESC_board.menu.pnum.WRAITH32_V1=Wraith V1 ESC
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.WRAITH32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.WRAITH32_V1.build.board=WRAITH32_V1
ESC_board.menu.pnum.WRAITH32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.WRAITH32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.WRAITH32_V1.build.variant=STM32F0xx/F051K(6-8)U
ESC_board.menu.pnum.WRAITH32_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ESC_board.menu.pnum.WRAITH32_V1.openocd.target=stm32f0x
ESC_board.menu.pnum.WRAITH32_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x1.svd

# STORM32_V1_RC board
ESC_board.menu.pnum.STORM32_V1_31_RC=STorM32 BGC v1.31 RC
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_size=262144
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_data_size=49152
ESC_board.menu.pnum.STORM32_V1_31_RC.build.mcu=cortex-m3
ESC_board.menu.pnum.STORM32_V1_31_RC.build.board=STORM32_V1_31_RC
ESC_board.menu.pnum.STORM32_V1_31_RC.build.series=STM32F1xx
ESC_board.menu.pnum.STORM32_V1_31_RC.build.product_line=STM32F103xE
ESC_board.menu.pnum.STORM32_V1_31_RC.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ESC_board.menu.pnum.STORM32_V1_31_RC.build.variant=STM32F1xx/F103R(C-D-E)T
ESC_board.menu.pnum.STORM32_V1_31_RC.openocd.target=stm32f1x
ESC_board.menu.pnum.STORM32_V1_31_RC.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=swd
ESC_board.menu.upload_method.swdMethod.upload.options=
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
ESC_board.menu.upload_method.jlinkMethod.upload.protocol=jlink
ESC_board.menu.upload_method.jlinkMethod.upload.options=
ESC_board.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=serial
ESC_board.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=dfu
ESC_board.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
ESC_board.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
ESC_board.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

ESC_board.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
ESC_board.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
ESC_board.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# Garatronic-McHobby STM32 boards

Garatronic.name=Garatronic-McHobby

Garatronic.build.core=arduino
Garatronic.build.board=Garatronic
Garatronic.build.variant_h=variant_{build.board}.h
Garatronic.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Garatronic.build.flash_offset=0x0
Garatronic.upload.maximum_size=0
Garatronic.upload.maximum_data_size=0
Garatronic.vid.0=0x0483
Garatronic.pid.0=0x5740

# PYBSTICK26(DUINO) board with F072RB
Garatronic.menu.pnum.PYBSTICK26_DUINO=PYBSTICK26 Duino
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_size=131072
Garatronic.menu.pnum.PYBSTICK26_DUINO.upload.maximum_data_size=16384
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.mcu=cortex-m0
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.board=PYBSTICK26_DUINO
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.series=STM32F0xx
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.product_line=STM32F072xB
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.variant=STM32F0xx/F072R8T_F072RB(H-I-T)
Garatronic.menu.pnum.PYBSTICK26_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_DUINO.openocd.target=stm32f0x
Garatronic.menu.pnum.PYBSTICK26_DUINO.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F0xx/STM32F0x2.svd

# PYBSTICK26(LITE) board with F401CE
Garatronic.menu.pnum.PYBSTICK26_LITE=PYBSTICK26 Lite
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_LITE.upload.maximum_data_size=98304
Garatronic.menu.pnum.PYBSTICK26_LITE.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_LITE.build.board=PYBSTICK26_LITE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_LITE.build.product_line=STM32F401xE
Garatronic.menu.pnum.PYBSTICK26_LITE.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
Garatronic.menu.pnum.PYBSTICK26_LITE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_LITE.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_LITE.build.float-abi=-mfloat-abi=hard
Garatronic.menu.pnum.PYBSTICK26_LITE.openocd.target=stm32f4x
Garatronic.menu.pnum.PYBSTICK26_LITE.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F401.svd

# PYBSTICK26(STD/Programmez!) board with F411RE
Garatronic.menu.pnum.PYBSTICK26_STD=PYBSTICK26 STD-Programmez
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_STD.upload.maximum_data_size=131072
Garatronic.menu.pnum.PYBSTICK26_STD.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_STD.build.board=PYBSTICK26_STD
Garatronic.menu.pnum.PYBSTICK26_STD.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_STD.build.product_line=STM32F411xE
Garatronic.menu.pnum.PYBSTICK26_STD.build.variant=STM32F4xx/F411R(C-E)T
Garatronic.menu.pnum.PYBSTICK26_STD.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_STD.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_STD.build.float-abi=-mfloat-abi=hard
Garatronic.menu.pnum.PYBSTICK26_STD.openocd.target=stm32f4x
Garatronic.menu.pnum.PYBSTICK26_STD.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F411.svd

# PYBSTICK26(PRO) board with F412RE
Garatronic.menu.pnum.PYBSTICK26_PRO=PYBSTICK26 Pro
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_size=524288
Garatronic.menu.pnum.PYBSTICK26_PRO.upload.maximum_data_size=262144
Garatronic.menu.pnum.PYBSTICK26_PRO.build.mcu=cortex-m4
Garatronic.menu.pnum.PYBSTICK26_PRO.build.board=PYBSTICK26_PRO
Garatronic.menu.pnum.PYBSTICK26_PRO.build.series=STM32F4xx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.product_line=STM32F412Rx
Garatronic.menu.pnum.PYBSTICK26_PRO.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)
Garatronic.menu.pnum.PYBSTICK26_PRO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
Garatronic.menu.pnum.PYBSTICK26_PRO.build.fpu=-mfpu=fpv4-sp-d16
Garatronic.menu.pnum.PYBSTICK26_PRO.build.float-abi=-mfloat-abi=hard
Garatronic.menu.pnum.PYBSTICK26_PRO.openocd.target=stm32f4x
Garatronic.menu.pnum.PYBSTICK26_PRO.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F4xx/STM32F412.svd

# PYBSTICK26 boards upload method
Garatronic.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Garatronic.menu.upload_method.dfuMethod.upload.protocol=dfu
Garatronic.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
Garatronic.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic Flight Controllers

