stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.name=Generic Flight Controllers

GenFlight.build.core=arduino
GenFlight.build.board=Genericflight
GenFlight.build.variant_h=variant_{build.board}.h
GenFlight.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenFlight.build.flash_offset=0x0
GenFlight.upload.maximum_size=0
GenFlight.upload.maximum_data_size=0
GenFlight.vid.0=0x0483
GenFlight.pid.0=0x5740

# AfroFlight Rev5
GenFlight.menu.pnum.AFROFLIGHT_F103CB=Afro Flight Rev5 (8MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.board=AFROFLIGHT_F103CB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.variant_h=variant_AFROFLIGHT_F103CB_XX.h
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.vid.0=0x1eaf
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.pid.0=0x0003
GenFlight.menu.pnum.AFROFLIGHT_F103CB.openocd.target=stm32f1x
GenFlight.menu.pnum.AFROFLIGHT_F103CB.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M=Afro Flight Rev5 (12MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.board=AFROFLIGHT_F103CB_12M
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant_h=variant_AFROFLIGHT_F103CB_XX.h
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.vid.0=0x1eaf
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.pid.0=0x0003
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.openocd.target=stm32f1x
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F1xx/STM32F103.svd

# Sparky_V1 board
GenFlight.menu.pnum.Sparky_V1=Sparky V1 F303 FC
GenFlight.menu.pnum.Sparky_V1.upload.maximum_size=262144
GenFlight.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
GenFlight.menu.pnum.Sparky_V1.build.mcu=cortex-m4
GenFlight.menu.pnum.Sparky_V1.build.series=STM32F3xx
GenFlight.menu.pnum.Sparky_V1.build.board=SPARKY_F303CC
GenFlight.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
GenFlight.menu.pnum.Sparky_V1.build.fpu=-mfpu=fpv4-sp-d16
GenFlight.menu.pnum.Sparky_V1.build.float-abi=-mfloat-abi=hard
GenFlight.menu.pnum.Sparky_V1.build.variant=STM32F3xx/F303C(B-C)T
GenFlight.menu.pnum.Sparky_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenFlight.menu.pnum.Sparky_V1.openocd.target=stm32f3x
GenFlight.menu.pnum.Sparky_V1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32F3xx/STM32F303.svd

# Upload menu
GenFlight.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenFlight.menu.upload_method.swdMethod.upload.protocol=swd
GenFlight.menu.upload_method.swdMethod.upload.options=
GenFlight.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenFlight.menu.upload_method.jlinkMethod.upload.protocol=jlink
GenFlight.menu.upload_method.jlinkMethod.upload.options=
GenFlight.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenFlight.menu.upload_method.serialMethod.upload.protocol=serial
GenFlight.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
GenFlight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenFlight.menu.upload_method.dfuMethod.upload.protocol=dfu
GenFlight.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
GenFlight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenFlight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenFlight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenFlight.menu.upload_method.hidMethod=HID Bootloader 2.2
GenFlight.menu.upload_method.hidMethod.upload.protocol=hid22
GenFlight.menu.upload_method.hidMethod.upload.tool=hid_upload
GenFlight.menu.upload_method.hidMethod.build.flash_offset=0x800
GenFlight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenFlight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenFlight.menu.upload_method.dfu2Method.upload.protocol=maple
GenFlight.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenFlight.menu.upload_method.dfu2Method.upload.altID=2
GenFlight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenFlight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF

GenFlight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenFlight.menu.upload_method.dfuoMethod.upload.protocol=maple
GenFlight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenFlight.menu.upload_method.dfuoMethod.upload.altID=1
GenFlight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenFlight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF

GenFlight.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
GenFlight.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
GenFlight.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

GenFlight.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
GenFlight.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
GenFlight.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# IoT continuum Boards

IotContinuum.name=IoT continuum boards

IotContinuum.build.core=arduino
IotContinuum.build.board=IOT_CONTINUUM
IotContinuum.build.variant_h=variant_{build.board}.h
IotContinuum.build.st_extra_flags=-D{build.product_line} {build.xSerial}
IotContinuum.build.flash_offset=0x0
IotContinuum.upload.maximum_size=0
IotContinuum.upload.maximum_data_size=0

