stm32duino/Arduino_Core_STM32/boards.txt
SparkFun.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
SparkFun.menu.upload_method.dfuMethod.upload.protocol=dfu
SparkFun.menu.upload_method.dfuMethod.upload.options=-v {upload.vid} -p {upload.pid}
SparkFun.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

SparkFun.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
SparkFun.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
SparkFun.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

SparkFun.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
SparkFun.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
SparkFun.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

################################################################################
# ELV Modular System boards

ELV_Modular_System.name=ELV Modular System boards
ELV_Modular_System.build.core=arduino
ELV_Modular_System.build.board=ELV_Modular_System
ELV_Modular_System.build.variant_h=variant_{build.board}.h
ELV_Modular_System.upload.maximum_size=0
ELV_Modular_System.upload.maximum_data_size=0

# ELV-BM-TRX1 board
ELV_Modular_System.menu.pnum.ELV_BM_TRX1=ELV-LW-Base ELV_BM_TRX1
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.upload.maximum_size=129024
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.upload.maximum_data_size=49152
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.mcu=cortex-m4
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.board=ELV_BM_TRX1
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.series=STM32WLxx
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.product_line=STM32WLE5xx
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.flash_offset=0x800
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.openocd.target=stm32wlx
ELV_Modular_System.menu.pnum.ELV_BM_TRX1.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WLxx/STM32WLE5_CM4.svd

# Upload menu
ELV_Modular_System.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD) with Bootloader
ELV_Modular_System.menu.upload_method.swdMethod.upload.protocol=swd
ELV_Modular_System.menu.upload_method.swdMethod.upload.options=
ELV_Modular_System.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ELV_Modular_System.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link) with Bootloader
ELV_Modular_System.menu.upload_method.jlinkMethod.upload.protocol=jlink
ELV_Modular_System.menu.upload_method.jlinkMethod.upload.options=
ELV_Modular_System.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

ELV_Modular_System.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial) with Bootloader
ELV_Modular_System.menu.upload_method.serialMethod.upload.protocol=serial
ELV_Modular_System.menu.upload_method.serialMethod.upload.options=-c {serial.port.file}
ELV_Modular_System.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

################################################################################
# STeaMi board
STeaMi.name=STeaMi Board
STeaMi.build.core=arduino
STeaMi.build.variant_h=variant_{build.board}.h
STeaMi.build.st_extra_flags=-D{build.product_line} {build.xSerial}
STeaMi.build.flash_offset=0x0
STeaMi.upload.maximum_size=0
STeaMi.upload.maximum_data_size=0
STeaMi.vid.0=0x0d28
STeaMi.pid.0=0x0204

STeaMi.menu.pnum.STEAM32_WB55RG=STeaMi
STeaMi.menu.pnum.STEAM32_WB55RG.node="STeaMi,DAPLINK"
STeaMi.menu.pnum.STEAM32_WB55RG.upload.maximum_size=524288
STeaMi.menu.pnum.STEAM32_WB55RG.upload.maximum_data_size=196608
STeaMi.menu.pnum.STEAM32_WB55RG.build.mcu=cortex-m4
STeaMi.menu.pnum.STEAM32_WB55RG.build.fpu=-mfpu=fpv4-sp-d16
STeaMi.menu.pnum.STEAM32_WB55RG.build.float-abi=-mfloat-abi=hard
STeaMi.menu.pnum.STEAM32_WB55RG.build.board=STEAM32_WB55RG
STeaMi.menu.pnum.STEAM32_WB55RG.build.series=STM32WBxx
STeaMi.menu.pnum.STEAM32_WB55RG.build.product_line=STM32WB55xx
STeaMi.menu.pnum.STEAM32_WB55RG.build.variant=STM32WBxx/WB55R(C-E-G)V
STeaMi.menu.pnum.STEAM32_WB55RG.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
STeaMi.menu.pnum.STEAM32_WB55RG.debug.server.openocd.scripts.1={runtime.platform.path}/debugger/select_swd.cfg
STeaMi.menu.pnum.STEAM32_WB55RG.openocd.target=stm32wbx
STeaMi.menu.pnum.STEAM32_WB55RG.debug.svd_file={runtime.tools.STM32_SVD.path}/svd/STM32WBxx/STM32WB55_CM4.svd

# Upload menu
STeaMi.menu.upload_method.MassStorage=Mass Storage
STeaMi.menu.upload_method.MassStorage.upload.protocol=
STeaMi.menu.upload_method.MassStorage.upload.tool=massStorageCopy

STeaMi.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
STeaMi.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
STeaMi.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload

STeaMi.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
STeaMi.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
STeaMi.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_32.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

Eval.menu.xserial.generic=Enabled (generic 'Serial')
Eval.menu.xserial.none=Enabled (no generic 'Serial')
Eval.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Eval.menu.xserial.disabled=Disabled (no Serial support)
Eval.menu.xserial.disabled.build.xSerial=

STM32MP1.menu.virtio.disable=Disabled (no SerialVirtIO nor /dev/ttyRPMSG0 available)
STM32MP1.menu.virtio.disable.build.enable_virtio=
STM32MP1.menu.virtio.generic=SerialVirtIO (= generic 'Serial') <=> /dev/ttyRPMSG0
STM32MP1.menu.virtio.generic.build.enable_virtio={build.virtio_flags}
STM32MP1.menu.virtio.enabled=SerialVirtIO <=> /dev/ttyRPMSG0
STM32MP1.menu.virtio.enabled.build.enable_virtio={build.virtio_flags} -DDISABLE_GENERIC_SERIALVIRTIO

STM32MP1.menu.xserial.generic=UART only (generic 'Serial')
STM32MP1.menu.xserial.generic.build.xSerial=-DHAL_UART_MODULE_ENABLED
STM32MP1.menu.xserial.none=UART only (no generic 'Serial')
STM32MP1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
STM32MP1.menu.xserial.disabled=Disabled (no Serial support)
STM32MP1.menu.xserial.disabled.build.xSerial=

GenC0.menu.xserial.generic=Enabled (generic 'Serial')
GenC0.menu.xserial.none=Enabled (no generic 'Serial')
GenC0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenC0.menu.xserial.disabled=Disabled (no Serial support)
GenC0.menu.xserial.disabled.build.xSerial=

GenF0.menu.xserial.generic=Enabled (generic 'Serial')
GenF0.menu.xserial.none=Enabled (no generic 'Serial')
GenF0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF0.menu.xserial.disabled=Disabled (no Serial support)
GenF0.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled (generic 'Serial')
GenF1.menu.xserial.none=Enabled (no generic 'Serial')
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (no Serial support)
GenF1.menu.xserial.disabled.build.xSerial=

GenF2.menu.xserial.generic=Enabled (generic 'Serial')
GenF2.menu.xserial.none=Enabled (no generic 'Serial')
GenF2.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF2.menu.xserial.disabled=Disabled (no Serial support)
GenF2.menu.xserial.disabled.build.xSerial=

GenF3.menu.xserial.generic=Enabled (generic 'Serial')
GenF3.menu.xserial.none=Enabled (no generic 'Serial')
GenF3.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF3.menu.xserial.disabled=Disabled (no Serial support)
GenF3.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

GenF7.menu.xserial.generic=Enabled (generic 'Serial')
GenF7.menu.xserial.none=Enabled (no generic 'Serial')
GenF7.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF7.menu.xserial.disabled=Disabled (no Serial support)
GenF7.menu.xserial.disabled.build.xSerial=

