stm32duino/Arduino_Core_STM32/boards.txt
GenC0.menu.dbg.none=None
GenC0.menu.dbg.enable=Symbols Enabled (-g)
GenC0.menu.dbg.enable.build.flags.debug=-g

GenF0.menu.dbg.none=None
GenF0.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF0.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF0.menu.dbg.enable_log=Core logs Enabled
GenF0.menu.dbg.enable_log.build.flags.debug=
GenF0.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF0.menu.dbg.enable_all.build.flags.debug=-g

GenF1.menu.dbg.none=None
GenF1.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF1.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF1.menu.dbg.enable_log=Core logs Enabled
GenF1.menu.dbg.enable_log.build.flags.debug=
GenF1.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF1.menu.dbg.enable_all.build.flags.debug=-g

GenF2.menu.dbg.none=None
GenF2.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF2.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF2.menu.dbg.enable_log=Core logs Enabled
GenF2.menu.dbg.enable_log.build.flags.debug=
GenF2.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF2.menu.dbg.enable_all.build.flags.debug=-g

GenF3.menu.dbg.none=None
GenF3.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF3.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF3.menu.dbg.enable_log=Core logs Enabled
GenF3.menu.dbg.enable_log.build.flags.debug=
GenF3.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF3.menu.dbg.enable_all.build.flags.debug=-g

GenF4.menu.dbg.none=None
GenF4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF4.menu.dbg.enable_log=Core logs Enabled
GenF4.menu.dbg.enable_log.build.flags.debug=
GenF4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF4.menu.dbg.enable_all.build.flags.debug=-g

GenF7.menu.dbg.none=None
GenF7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF7.menu.dbg.enable_log=Core logs Enabled
GenF7.menu.dbg.enable_log.build.flags.debug=
GenF7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF7.menu.dbg.enable_all.build.flags.debug=-g

GenG0.menu.dbg.none=None
GenG0.menu.dbg.enable_sym=Symbols Enabled (-g)
GenG0.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenG0.menu.dbg.enable_log=Core logs Enabled
GenG0.menu.dbg.enable_log.build.flags.debug=
GenG0.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenG0.menu.dbg.enable_all.build.flags.debug=-g

GenG4.menu.dbg.none=None
GenG4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenG4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenG4.menu.dbg.enable_log=Core logs Enabled
GenG4.menu.dbg.enable_log.build.flags.debug=
GenG4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenG4.menu.dbg.enable_all.build.flags.debug=-g

GenH5.menu.dbg.none=None
GenH5.menu.dbg.enable_sym=Symbols Enabled (-g)
GenH5.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenH5.menu.dbg.enable_log=Core logs Enabled
GenH5.menu.dbg.enable_log.build.flags.debug=
GenH5.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenH5.menu.dbg.enable_all.build.flags.debug=-g

GenH7.menu.dbg.none=None
GenH7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenH7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenH7.menu.dbg.enable_log=Core logs Enabled
GenH7.menu.dbg.enable_log.build.flags.debug=
GenH7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenH7.menu.dbg.enable_all.build.flags.debug=-g

GenL0.menu.dbg.none=None
GenL0.menu.dbg.enable_sym=Symbols Enabled (-g)
GenL0.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenL0.menu.dbg.enable_log=Core logs Enabled
GenL0.menu.dbg.enable_log.build.flags.debug=
GenL0.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenL0.menu.dbg.enable_all.build.flags.debug=-g

GenL1.menu.dbg.none=None
GenL1.menu.dbg.enable_sym=Symbols Enabled (-g)
GenL1.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenL1.menu.dbg.enable_log=Core logs Enabled
GenL1.menu.dbg.enable_log.build.flags.debug=
GenL1.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenL1.menu.dbg.enable_all.build.flags.debug=-g

GenL4.menu.dbg.none=None
GenL4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenL4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenL4.menu.dbg.enable_log=Core logs Enabled
GenL4.menu.dbg.enable_log.build.flags.debug=
GenL4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenL4.menu.dbg.enable_all.build.flags.debug=-g

GenL5.menu.dbg.none=None
GenL5.menu.dbg.enable_sym=Symbols Enabled (-g)
GenL5.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenL5.menu.dbg.enable_log=Core logs Enabled
GenL5.menu.dbg.enable_log.build.flags.debug=
GenL5.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenL5.menu.dbg.enable_all.build.flags.debug=-g

GenU0.menu.dbg.none=None
GenU0.menu.dbg.enable_sym=Symbols Enabled (-g)
GenU0.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenU0.menu.dbg.enable_log=Core logs Enabled
GenU0.menu.dbg.enable_log.build.flags.debug=
GenU0.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenU0.menu.dbg.enable_all.build.flags.debug=-g

GenU5.menu.dbg.none=None
GenU5.menu.dbg.enable_sym=Symbols Enabled (-g)
GenU5.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenU5.menu.dbg.enable_log=Core logs Enabled
GenU5.menu.dbg.enable_log.build.flags.debug=
GenU5.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenU5.menu.dbg.enable_all.build.flags.debug=-g

GenWB.menu.dbg.none=None
GenWB.menu.dbg.enable_sym=Symbols Enabled (-g)
GenWB.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenWB.menu.dbg.enable_log=Core logs Enabled
GenWB.menu.dbg.enable_log.build.flags.debug=
GenWB.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenWB.menu.dbg.enable_all.build.flags.debug=-g

GenWBA.menu.dbg.none=None
GenWBA.menu.dbg.enable_sym=Symbols Enabled (-g)
GenWBA.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenWBA.menu.dbg.enable_log=Core logs Enabled
GenWBA.menu.dbg.enable_log.build.flags.debug=
GenWBA.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenWBA.menu.dbg.enable_all.build.flags.debug=-g

GenWL.menu.dbg.none=None
GenWL.menu.dbg.enable_sym=Symbols Enabled (-g)
GenWL.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenWL.menu.dbg.enable_log=Core logs Enabled
GenWL.menu.dbg.enable_log.build.flags.debug=
GenWL.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenWL.menu.dbg.enable_all.build.flags.debug=-g

3dprinter.menu.dbg.none=None
3dprinter.menu.dbg.enable_sym=Symbols Enabled (-g)
3dprinter.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
3dprinter.menu.dbg.enable_log=Core logs Enabled
3dprinter.menu.dbg.enable_log.build.flags.debug=
3dprinter.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
3dprinter.menu.dbg.enable_all.build.flags.debug=-g

Blues.menu.dbg.none=None
Blues.menu.dbg.enable_sym=Symbols Enabled (-g)
Blues.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Blues.menu.dbg.enable_log=Core logs Enabled
Blues.menu.dbg.enable_log.build.flags.debug=
Blues.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Blues.menu.dbg.enable_all.build.flags.debug=-g

Elecgator.menu.dbg.none=None
Elecgator.menu.dbg.enable_sym=Symbols Enabled (-g)
Elecgator.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Elecgator.menu.dbg.enable_log=Core logs Enabled
Elecgator.menu.dbg.enable_log.build.flags.debug=
Elecgator.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Elecgator.menu.dbg.enable_all.build.flags.debug=-g

ESC_board.menu.dbg.none=None
ESC_board.menu.dbg.enable_sym=Symbols Enabled (-g)
ESC_board.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ESC_board.menu.dbg.enable_log=Core logs Enabled
ESC_board.menu.dbg.enable_log.build.flags.debug=
ESC_board.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ESC_board.menu.dbg.enable_all.build.flags.debug=-g

Garatronic.menu.dbg.none=None
Garatronic.menu.dbg.enable_sym=Symbols Enabled (-g)
Garatronic.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Garatronic.menu.dbg.enable_log=Core logs Enabled
Garatronic.menu.dbg.enable_log.build.flags.debug=
Garatronic.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Garatronic.menu.dbg.enable_all.build.flags.debug=-g

GenFlight.menu.dbg.none=None
GenFlight.menu.dbg.enable_sym=Symbols Enabled (-g)
GenFlight.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenFlight.menu.dbg.enable_log=Core logs Enabled
GenFlight.menu.dbg.enable_log.build.flags.debug=
GenFlight.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenFlight.menu.dbg.enable_all.build.flags.debug=-g

IotContinuum.menu.dbg.none=None
IotContinuum.menu.dbg.enable_sym=Symbols Enabled (-g)
IotContinuum.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
IotContinuum.menu.dbg.enable_log=Core logs Enabled
IotContinuum.menu.dbg.enable_log.build.flags.debug=
IotContinuum.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
IotContinuum.menu.dbg.enable_all.build.flags.debug=-g

LoRa.menu.dbg.none=None
LoRa.menu.dbg.enable_sym=Symbols Enabled (-g)
LoRa.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
LoRa.menu.dbg.enable_log=Core logs Enabled
LoRa.menu.dbg.enable_log.build.flags.debug=
LoRa.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
LoRa.menu.dbg.enable_all.build.flags.debug=-g

