stm32duino/Arduino_Core_STM32/boards.txt
Midatronics.menu.dbg.none=None
Midatronics.menu.dbg.enable_sym=Symbols Enabled (-g)
Midatronics.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Midatronics.menu.dbg.enable_log=Core logs Enabled
Midatronics.menu.dbg.enable_log.build.flags.debug=
Midatronics.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Midatronics.menu.dbg.enable_all.build.flags.debug=-g

SparkFun.menu.dbg.none=None
SparkFun.menu.dbg.enable_sym=Symbols Enabled (-g)
SparkFun.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
SparkFun.menu.dbg.enable_log=Core logs Enabled
SparkFun.menu.dbg.enable_log.build.flags.debug=
SparkFun.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
SparkFun.menu.dbg.enable_all.build.flags.debug=-g

ELV_Modular_System.menu.dbg.none=None
ELV_Modular_System.menu.dbg.enable_sym=Symbols Enabled (-g)
ELV_Modular_System.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
ELV_Modular_System.menu.dbg.enable_log=Core logs Enabled
ELV_Modular_System.menu.dbg.enable_log.build.flags.debug=
ELV_Modular_System.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
ELV_Modular_System.menu.dbg.enable_all.build.flags.debug=-g

STeaMi.menu.dbg.none=None
STeaMi.menu.dbg.enable_sym=Symbols Enabled (-g)
STeaMi.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
STeaMi.menu.dbg.enable_log=Core logs Enabled
STeaMi.menu.dbg.enable_log.build.flags.debug=
STeaMi.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
STeaMi.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

Disco.menu.rtlib.nano=Newlib Nano (default)
Disco.menu.rtlib.nanofp=Newlib Nano + Float Printf
Disco.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Disco.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Disco.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Disco.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Disco.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Disco.menu.rtlib.full=Newlib Standard
Disco.menu.rtlib.full.build.flags.ldspecs=

Eval.menu.rtlib.nano=Newlib Nano (default)
Eval.menu.rtlib.nanofp=Newlib Nano + Float Printf
Eval.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Eval.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Eval.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Eval.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Eval.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Eval.menu.rtlib.full=Newlib Standard
Eval.menu.rtlib.full.build.flags.ldspecs=

STM32MP1.menu.rtlib.nano=Newlib Nano (default)
STM32MP1.menu.rtlib.nanofp=Newlib Nano + Float Printf
STM32MP1.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
STM32MP1.menu.rtlib.nanofs=Newlib Nano + Float Scanf
STM32MP1.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
STM32MP1.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
STM32MP1.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
STM32MP1.menu.rtlib.full=Newlib Standard
STM32MP1.menu.rtlib.full.build.flags.ldspecs=

GenC0.menu.rtlib.nano=Newlib Nano (default)
GenC0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenC0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenC0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenC0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenC0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenC0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenC0.menu.rtlib.full=Newlib Standard
GenC0.menu.rtlib.full.build.flags.ldspecs=

GenF0.menu.rtlib.nano=Newlib Nano (default)
GenF0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF0.menu.rtlib.full=Newlib Standard
GenF0.menu.rtlib.full.build.flags.ldspecs=

GenF1.menu.rtlib.nano=Newlib Nano (default)
GenF1.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF1.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF1.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF1.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF1.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF1.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF1.menu.rtlib.full=Newlib Standard
GenF1.menu.rtlib.full.build.flags.ldspecs=

GenF2.menu.rtlib.nano=Newlib Nano (default)
GenF2.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF2.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF2.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF2.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF2.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF2.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF2.menu.rtlib.full=Newlib Standard
GenF2.menu.rtlib.full.build.flags.ldspecs=

GenF3.menu.rtlib.nano=Newlib Nano (default)
GenF3.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF3.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF3.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF3.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF3.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF3.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF3.menu.rtlib.full=Newlib Standard
GenF3.menu.rtlib.full.build.flags.ldspecs=

GenF4.menu.rtlib.nano=Newlib Nano (default)
GenF4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF4.menu.rtlib.full=Newlib Standard
GenF4.menu.rtlib.full.build.flags.ldspecs=

GenF7.menu.rtlib.nano=Newlib Nano (default)
GenF7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF7.menu.rtlib.full=Newlib Standard
GenF7.menu.rtlib.full.build.flags.ldspecs=

GenG0.menu.rtlib.nano=Newlib Nano (default)
GenG0.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenG0.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenG0.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenG0.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenG0.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenG0.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenG0.menu.rtlib.full=Newlib Standard
GenG0.menu.rtlib.full.build.flags.ldspecs=

GenG4.menu.rtlib.nano=Newlib Nano (default)
GenG4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenG4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenG4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenG4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenG4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenG4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenG4.menu.rtlib.full=Newlib Standard
GenG4.menu.rtlib.full.build.flags.ldspecs=

GenH5.menu.rtlib.nano=Newlib Nano (default)
GenH5.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH5.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH5.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH5.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH5.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH5.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH5.menu.rtlib.full=Newlib Standard
GenH5.menu.rtlib.full.build.flags.ldspecs=

GenH7.menu.rtlib.nano=Newlib Nano (default)
GenH7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH7.menu.rtlib.full=Newlib Standard
GenH7.menu.rtlib.full.build.flags.ldspecs=

